[
    {
        "title": "A Time for Bravery",
        "year": "2025",
        "description": "A psychoanalyst on community service aids an agent shattered by infidelity; together, they will confront danger and discover second chances.",
        "genre": "Comedy, Action",
        "director": "Ariel Winograd",
        "poster": "https://image.tmdb.org/t/p/w500/qKKG22O5pFxqglG0oMjWTjQWCNl.jpg",
        "category": "movies",
        "reason": "Keyword: infidelity"
    },
    {
        "title": "The Naked Gun",
        "year": "2025",
        "description": "Only one man has the particular set of skills... to lead Police Squad and save the world: Lt. Frank Drebin Jr. Following in his father's footsteps, he must solve a murder case to prevent Police Squad from closure.",
        "genre": "Action, Comedy, Crime",
        "director": "Akiva Schaffer",
        "poster": "https://image.tmdb.org/t/p/w500/rmwQ8GsdQ1M3LtemNWLErle2nBU.jpg",
        "category": "movies",
        "reason": "Keyword: naked"
    },
    {
        "title": "Vick & Tarstar's Scarecrow Factory",
        "year": "2025",
        "description": "Vick & Tarstar are shooting their latest horror movie trash epic, Scarecrowed, with a cast and crew of punks, drug addicts, fetish models and dumpster divers. Set back with extra hairy relationship drama, homelessness, lack of funding, and their crew members quitting, Vick & Tarstar just want to tell their story: With the right bucket, you too can buy your own hair cutting scarecrow made by the animatronic Goo Guys at the Scarecrow Factory.",
        "genre": "Horror, Drama",
        "director": "Brewce Longo",
        "poster": "https://image.tmdb.org/t/p/w500/w89KD6JyFEasNG3xsTFz255qyBt.jpg",
        "category": "movies",
        "reason": "Keyword: fetish"
    },
    {
        "title": "The Voyeurs",
        "year": "2021",
        "description": "When Pippa and Thomas move into their dream apartment, they notice that their windows look directly into the apartment opposite – inviting them to witness the volatile relationship of the attractive couple across the street. But what starts as a simple curiosity turns into full-blown obsession with increasingly dangerous consequences.",
        "genre": "Thriller",
        "director": "Michael Mohan",
        "poster": "https://image.tmdb.org/t/p/w500/8Y4XOIWhpOvSOEn8XrxbkH9yAXO.jpg",
        "category": "movies",
        "reason": "Keyword: voyeur"
    },
    {
        "title": "Striptease",
        "year": "1996",
        "description": "Bounced from her job, Erin Grant needs money if she's to have any chance of winning back custody of her child. But, eventually, she must confront the naked truth: to take on the system, she'll have to take it all off. Erin strips to conquer, but she faces unintended circumstances when a hound dog of a Congressman zeroes in on her and sharpens the shady tools at his fingertips, including blackmail and murder.",
        "genre": "Comedy, Crime, Drama",
        "director": "Andrew Bergman",
        "poster": "https://image.tmdb.org/t/p/w500/4zMy6R7acotCmGoDk4sjzRtDwKn.jpg",
        "category": "movies",
        "reason": "Keyword: striptease"
    },
    {
        "title": "Hot Shots!",
        "year": "1991",
        "description": "The gang that created Airplane! and The Naked Gun sets its sights on Top Gun in this spoof. Topper Harley is a talented but unstable fighter pilot with an axe to grind: clearing the family name. His mission is to avenge his father and save a mission sabotaged by greedy weapons manufacturers. He also gets involved in a relationship with Ramada Thompson, a woman with an unusually talented stomach. Hot Shots! makes fun of a variety of other films, from Dances with Wolves to The Fabulous Baker Boys.",
        "genre": "Action, Comedy, War",
        "director": "Jim Abrahams",
        "poster": "https://image.tmdb.org/t/p/w500/koLIB5263emHxewmwgBBK26vjeS.jpg",
        "category": "movies",
        "reason": "Keyword: naked"
    },
    {
        "title": "The Naked Gun 2½: The Smell of Fear",
        "year": "1991",
        "description": "Bumbling lieutenant Frank Drebin is out to foil the big boys in the energy industry, who intend to suppress technology that will put them out of business.",
        "genre": "Comedy, Crime",
        "director": "David Zucker",
        "poster": "https://image.tmdb.org/t/p/w500/v9niLQWVzVPB1cP1ThNdEaLZG1Q.jpg",
        "category": "movies",
        "reason": "Keyword: naked"
    },
    {
        "title": "Pocket Listing",
        "year": "2016",
        "description": "A satirical thriller about L.A.'s real estate roller coaster. Double crosses, adultery, murder, mistaken identity, and revenge ensues when a mysterious power player and his sultry wife hire a disgraced Los Angeles property broker to discreetly market and sell their Malibu villa.",
        "genre": "Action, Comedy, Crime",
        "director": "Conor Allyn",
        "poster": "https://image.tmdb.org/t/p/w500/bnfGQD0ku046ueGDvF5PIkwrd23.jpg",
        "category": "movies",
        "reason": "Keyword: adultery"
    },
    {
        "title": "Beauty Betrayed",
        "year": "2002",
        "description": "A gun fires and supermodel Lily Sampson is dead. Two cops, Clark and his new partner Allie, are on the case. Their only clues are a revealing videotape of the victim in a searing game of bondage with a famous fashion photographer, and Lily's high school yearbook which reveals a mysterious twin sister and clues to a lifelong rivalry with another model.",
        "genre": "Drama, Thriller, Crime",
        "director": "John Quinn",
        "poster": "https://image.tmdb.org/t/p/w500/jyMD70cNIDnWmvTmoeTeue6Grgu.jpg",
        "category": "movies",
        "reason": "Keyword: bondage"
    },
    {
        "title": "Seeing Through",
        "year": "1998",
        "description": "Pieter Le Roy is in his thirties and still lives with his old mother. He doesn't work and kills time spying on his fellow man - actually, he's spying on them; he comes to a head when he is caught by a making out couple in the park as a voyeur. His life as a peeping Tom gets in more trouble when teacher Rappange comes to live with them.",
        "genre": "Drama",
        "director": "Gerrit van Elst",
        "poster": "https://image.tmdb.org/t/p/w500/9xiSTU9rZpT73QHGhhJxwmwtQOV.jpg",
        "category": "movies",
        "reason": "Keyword: voyeur"
    },
    {
        "title": "American Pie Presents: The Naked Mile",
        "year": "2006",
        "description": "When Erik Stifler realizes that he's the only Stifler family member who might graduate high school a virgin, he decides to live up to his legacy. After some well-meaning advice from Jim's dad, Erik's ready to take his chances at the annual and infamous Naked Mile race, where his devoted friends and some uninhibited sorority girls will create the most outrageous weekend ever.",
        "genre": "Comedy",
        "director": "Joe Nussbaum",
        "poster": "https://image.tmdb.org/t/p/w500/6CPJVJrqVjibP5Uub8yCg4FKtJi.jpg",
        "category": "movies",
        "reason": "Keyword: naked"
    },
    {
        "title": "Sheer Passion",
        "year": "1998",
        "description": "A lingerie model has been strangled inside a wealthy fashion designer's house, and the designer is the obvious suspect. When the police appear to be dragging their feet on the investigation, private detective Cassandra decides to do her own investigation, posing as a model.",
        "genre": "Thriller",
        "director": "John Quinn",
        "poster": "https://image.tmdb.org/t/p/w500/tSXya6cGYrP6nVUaHCPcJDaRK7a.jpg",
        "category": "movies",
        "reason": "Keyword: lingerie"
    },
    {
        "title": "Memoirs of a French Whore",
        "year": "1979",
        "description": "Marie is nineteen and bored in her little suburban life with no future. In a café, she meets the charismatic and beautiful Gerard. Blinded by adoration, Mary decides to leave her parents and her clerk job to live with the man she considers as the love of her life. But Gerard is a pimp, who soon forces her into prostitution. From within homes to out on the streets, the young woman gradually discovers a world of decay and violence.",
        "genre": "Drama",
        "director": "Daniel Duval",
        "poster": "https://image.tmdb.org/t/p/w500/VP87ViCiYg0KAAfAreir3FsCyv.jpg",
        "category": "movies",
        "reason": "Keyword: prostitution"
    },
    {
        "title": "Parasites",
        "year": "2016",
        "description": "A group of friends get lost in the seedy streets where they encounter a crazed gang of homeless derelicts that seizes them and kills them one by one. The surviving man escapes on foot, naked and unarmed, with a pack of depraved transients in pursuit, and only seconds away from capture.",
        "genre": "Action, Horror, Thriller",
        "director": "Chad Ferrin",
        "poster": "https://image.tmdb.org/t/p/w500/obuKZoMfZBcGYYt9W4kjrrqWeEh.jpg",
        "category": "movies",
        "reason": "Keyword: naked"
    },
    {
        "title": "Embalming",
        "year": "1999",
        "description": "Young female embalmer Miyako is called in to restore the body of a young man who has committed suicide, before the funeral. While performing the embalming process she finds herself pricks by a needle buried deep in the boy’s flesh where it should not be. During the night the head is removed from the body and stolen, Miyako begins a desperate search for it so she can finish her work. Miyako search finds her encountering organ harvesting, religious cults, incest, psychopathic schizophrenics as well as some very dark secrets from here own past.",
        "genre": "Drama, Horror, Mystery, Thriller",
        "director": "Shinji Aoyama",
        "poster": "https://image.tmdb.org/t/p/w500/sHIYcjBkQfjiXMaJzooN8koGnlD.jpg",
        "category": "movies",
        "reason": "Keyword: incest"
    },
    {
        "title": "Julie",
        "year": "2004",
        "description": "A broken hearted Julie comes to Mumbai to make a living, but the fast moving city will force her to take prostitution as her profession.",
        "genre": "Drama, Romance",
        "director": "Deepak S. Shivdasani",
        "poster": "https://image.tmdb.org/t/p/w500/6hpTNpsA1vwrlPM4R2qaVzRdBBO.jpg",
        "category": "movies",
        "reason": "Keyword: prostitution"
    },
    {
        "title": "Murder",
        "year": "2004",
        "description": "To escape a secure but stifling life with her workaholic husband Sudhir, bored housewife Simran begins an affair with Sunny, an ex-boyfriend from her college days. However, when Sudhir grows suspicious and hires a private detective, the infidelity soon comes to light.",
        "genre": "Drama, Thriller",
        "director": "Anurag Basu",
        "poster": "https://image.tmdb.org/t/p/w500/j14NjDFy7QQWHDSzfO9EkZvc9ZF.jpg",
        "category": "movies",
        "reason": "Keyword: infidelity"
    },
    {
        "title": "Zero Woman: Final Mission",
        "year": "1995",
        "description": "A famous businessman's links with organized crime are looked into by the Zero Division of the Tokyo Police, with the investigation being headed by a highly trained, extremely violent and very beautiful female officer. When not having shoot-outs with the crime syndicate thugs trying to kill her, she spends most of her time in her apartment, wearing lingerie and taking showers. A sub-plot involves the businessman's S&amp;M-obsessed daughter.",
        "genre": "Drama, Action",
        "director": "Koji Enokido",
        "poster": "https://image.tmdb.org/t/p/w500/lJMiK0iKeNLhjNYYyi6fvJ0NsWz.jpg",
        "category": "movies",
        "reason": "Keyword: lingerie"
    },
    {
        "title": "Secret Sharer",
        "year": "2014",
        "description": "On a rusting cargo ship in the South China Sea, it's the young Polish captain's first command. His mutinous Chinese crew suspect him and his unscrupulous Boss of planning to scuttle the ship for an insurance scam. When the crew abandon ship, the young captain is left alone on board, helpless, anchored in a bay. That night while waiting anxiously on deck, he finds a naked body floating in the sea below, tangled up in the ship's rope ladder. Pulling the ladder, the captain discovers a Chinese woman in distress. She climbs on board, saying only \"Hide me\". Dawn comes a few hours later and so does a search party, looking for a murderer.....",
        "genre": "Thriller, Drama, Romance",
        "director": "Peter Fudakowski",
        "poster": "https://image.tmdb.org/t/p/w500/vKvzMDeumahZt5LiASsretMA6Ng.jpg",
        "category": "movies",
        "reason": "Keyword: naked"
    },
    {
        "title": "Johnny Yuma",
        "year": "1966",
        "description": "Infidelity, murder, and betrayal lies at the center of this violent Spaghetti western. A scheming wife does away with her husband, causing the man's heir to seek revenge. A number of double-crosses and bloody gun battles follow, eventually driving the woman to flee into the desert.",
        "genre": "Action, Drama, Western",
        "director": "Romolo Guerrieri",
        "poster": "https://image.tmdb.org/t/p/w500/yMSMrhljP5NYgWeVh6GgexIx4Dg.jpg",
        "category": "movies",
        "reason": "Keyword: infidelity"
    },
    {
        "title": "The Beauty of Vice",
        "year": "1986",
        "description": "In the mountains of Montenegro people have lived by strict and Draconian laws for centuries, almost untouched by modern civilization. However, a young couple are going to seek their fortune on the more liberal coast and there they find jobs in the nudist colony. Hundreds of naked bodies and atmosphere of joie d'vivre make the husband and wife question their rigid way of life.",
        "genre": "Drama, Comedy",
        "director": "Živko Nikolić",
        "poster": "https://image.tmdb.org/t/p/w500/wpM2lbfua9HT5RiheMqZXzdvHPn.jpg",
        "category": "movies",
        "reason": "Keyword: naked"
    },
    {
        "title": "In the Shadow of Iris",
        "year": "2016",
        "description": "The sudden disappearance of a wealthy banker's wife cracks open a dizzying world of secret fetishes, desperate acts and elaborate deceptions.",
        "genre": "Thriller, Drama",
        "director": "Jalil Lespert",
        "poster": "https://image.tmdb.org/t/p/w500/tzVLPSoLfs0U3JHeGW5RKvsRAO.jpg",
        "category": "movies",
        "reason": "Keyword: fetish"
    },
    {
        "title": "The Queens",
        "year": "1966",
        "description": "Four comedic shorts explore quirky relationships and misadventures: a teenage girl's journey home, a self-serving babysitter, a husband confronting infidelity, and a wealthy woman's drunken escapades with her butler.",
        "genre": "Comedy",
        "director": "Mauro Bolognini",
        "poster": "https://image.tmdb.org/t/p/w500/wtzEDZfxE7Adu1Dpxeol4nsPo1b.jpg",
        "category": "movies",
        "reason": "Keyword: infidelity"
    },
    {
        "title": "Prep School",
        "year": "2016",
        "description": "Upon learning of his girlfriend's infidelity, Greg, the star player of his elite private school’s rugby team, suffers an emotional breakdown, leaving his friends and teammates to pick up the pieces and deal with the crisis in their own ways, ranging from heroic to apathetic to downright horrifying.",
        "genre": "Drama, Mystery",
        "director": "Sean Nichols Lynch",
        "poster": "https://image.tmdb.org/t/p/w500/aWGukFHnRTEu7ZUup02UmExby5i.jpg",
        "category": "movies",
        "reason": "Keyword: infidelity"
    },
    {
        "title": "Want It",
        "year": "2015",
        "description": "An intruder breaks into a modern and luxurious home. He wants it. As he samples the lifestyle his senses are heightened. When the owner of the house returns unexpectedly, the tables are turned, and the intruder finds himself naked and powerless. A film about passion, longing and desire in all its forms.",
        "genre": "Drama",
        "director": "Lee Haven Jones",
        "poster": "https://image.tmdb.org/t/p/w500/uCaZnhVbrl9hFEuBDP7DVIOTkU2.jpg",
        "category": "movies",
        "reason": "Keyword: naked"
    },
    {
        "title": "Black Cobra",
        "year": "1976",
        "description": "After a swift courtship, wealthy bachelor Judas Carmichael invites a topless dancer to live with him and his abundant collection of exotic snakes.",
        "genre": "Drama, Thriller, Horror",
        "director": "Joe D'Amato",
        "poster": "https://image.tmdb.org/t/p/w500/wZ2QgscQS7DbrcgRcroryCUskuG.jpg",
        "category": "movies",
        "reason": "Keyword: topless"
    },
    {
        "title": "Love Field",
        "year": "1992",
        "description": "Dallas housewife Lurene Hallett's life revolves around the doings of Jacqueline Kennedy. She is devastated when President Kennedy is shot a few hours after she sees him arrive in Dallas. Despite her husband Ray's prohibition, she decides to attend the funeral in Washington, D.C. Forced to travel by bus, she befriends Jonell, the young black daughter of Paul Couter. Sensing something wrong, her good intentioned interference leads the mixed race threesome on an increasingly difficult journey to Washington with both the police and Ray looking for them.",
        "genre": "Drama, Romance",
        "director": "Jonathan Kaplan",
        "poster": "https://image.tmdb.org/t/p/w500/u0qV3fFXWM6yGMlaqz3EWNSodB4.jpg",
        "category": "movies",
        "reason": "Keyword: threesome"
    },
    {
        "title": "Cafe Society",
        "year": "1997",
        "description": "New York 1952. Mickey Jelke inherits a big sum of money and spends his nights in Manhattan, painting the city red. Night after night, he can be found in one Broadway bar or the other, in the company of disreputable persons like pimps and prostitutes. One day,a shady cop, aided by Mickey's own girlfriend, Patricia, decides to accuse him of running a prostitution network. A scandal breaks out.",
        "genre": "Crime, Mystery, Drama",
        "director": "Raymond De Felitta",
        "poster": "https://image.tmdb.org/t/p/w500/94W02LaPPwokNIYqGsMlROWUeqe.jpg",
        "category": "movies",
        "reason": "Keyword: prostitution"
    },
    {
        "title": "El Cortejo",
        "year": "2025",
        "description": "Inside a van following a funeral procession on the highway, Rosa begins to speculate about a possible infidelity between her husband, Everardo, and her sister, Cecilia, who, uncomfortably, also accompany her in the vehicle. The silence of mourning transforms into a tense and unsettling atmosphere as the van moves forward.",
        "genre": "Drama, Family",
        "director": "Gerardo García León",
        "poster": "https://image.tmdb.org/t/p/w500/kTKAAbF9bE3RghaLpuRmlB7cKdw.jpg",
        "category": "movies",
        "reason": "Keyword: infidelity"
    },
    {
        "title": "The Life",
        "year": "2004",
        "description": "An anthropology student exploring the nature of prostitution is drawn deeper into that profession than she ever expected.",
        "genre": "Drama",
        "director": "María Lidón",
        "poster": "https://image.tmdb.org/t/p/w500/gjItTS8d5XNSfvHEdZ0XSZbPDuv.jpg",
        "category": "movies",
        "reason": "Keyword: prostitution"
    },
    {
        "title": "I See Naked",
        "year": "1969",
        "description": "Seven sketches including the title sketch \"I See Naked\" in which a fashion editor begins to see naked women everywhere he goes.",
        "genre": "Comedy",
        "director": "Dino Risi",
        "poster": "https://image.tmdb.org/t/p/w500/rY7Wx2RDfurzZKSzsm8TQj8hvMr.jpg",
        "category": "movies",
        "reason": "Keyword: naked"
    },
    {
        "title": "Ten Canoes",
        "year": "2006",
        "description": "A story within a story within a story. In Australia's Northern Territory, an Aboriginal narrator tells a story about his ancestors on a goose hunt. A youngster on the hunt is being tempted to adultery with his elder brother's wife, so an elder tells him a story from the mythical past about how evil can slip in and cause havoc unless prevented by virtue according to customary tribal law.",
        "genre": "Adventure, Comedy, Drama",
        "director": "Rolf de Heer",
        "poster": "https://image.tmdb.org/t/p/w500/uF9xjL2IJ6Wa9F8FQ1Is6Htu0Ka.jpg",
        "category": "movies",
        "reason": "Keyword: adultery"
    },
    {
        "title": "Street Scene",
        "year": "1931",
        "description": "The setting is a city block during a sweltering summer, where the residents serve as representatives of the not-very-idealized American melting pot. There is idle chitchat, gossip, jealousy, racism, adultery, and suddenly but not unexpectedly, a murder.",
        "genre": "Drama, Romance",
        "director": "King Vidor",
        "poster": "https://image.tmdb.org/t/p/w500/x80hXmYooG76fm37j0rQkw3q4Ct.jpg",
        "category": "movies",
        "reason": "Keyword: adultery"
    }
]