[
    {
        "title": "MaXXXine",
        "year": "2024",
        "description": "In 1980s Hollywood, adult film star and aspiring actress Maxine Minx finally gets her big break. But as a mysterious killer stalks the starlets of Hollywood, a trail of blood threatens to reveal her sinister past.",
        "genre": "Horror, Thriller",
        "director": "Ti West",
        "poster": "https://image.tmdb.org/t/p/w500/ArvoFK6nlouZRxYmtIOUzKIrg90.jpg",
        "category": "movies",
        "reason": "Keyword: xxx"
    },
    {
        "title": "Adaptation.",
        "year": "2002",
        "description": "Charlie Kaufman is a confused L.A. screenwriter overwhelmed by feelings of inadequacy, sexual frustration, self-loathing, and by the screenwriting ambitions of his freeloading twin brother Donald. While struggling to adapt \"The Orchid Thief,\" by Susan Orlean, Kaufman's life spins from pathetic to bizarre. The lives of Kaufman, Orlean's book, become strangely intertwined as each one's search for passion collides with the others'.",
        "genre": "Comedy, Crime, Drama",
        "director": "Spike Jonze",
        "poster": "https://image.tmdb.org/t/p/w500/ffEmHQAiD0m5dEQ6rlsuA9vlllW.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "xXx",
        "year": "2002",
        "description": "Xander Cage is your standard adrenaline junkie with no fear and a lousy attitude. When the US Government \"recruits\" him to go on a mission, he's not exactly thrilled. His mission: to gather information on an organization that may just be planning the destruction of the world, led by the nihilistic Yorgi.",
        "genre": "Action, Adventure, Thriller, Crime, Drama",
        "director": "Rob Cohen",
        "poster": "https://image.tmdb.org/t/p/w500/xeEw3eLeSFmJgXZzmF2Efww0q3s.jpg",
        "category": "movies",
        "reason": "Keyword: xxx"
    },
    {
        "title": "First Moon",
        "year": "2025",
        "description": "A young waitress is abducted by a religious cult, who are hell-bent on curing her from a sexually transmitted werewolf virus - or killing her in the process. Will she escape before the first full moon?",
        "genre": "Horror, Thriller",
        "director": "Peter McLeod",
        "poster": "https://image.tmdb.org/t/p/w500/hcjYvv4k9qs0lDG1Q3GIglT30IW.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Sins of Sister Lucia",
        "year": "1978",
        "description": "Rumiko is a misbehaving girl who got caught stealing the cash her father had at home for bribes. Father would not accuse her of that, but when he caught her having sex with her English teacher, he was justified in sending her to a monastery, where the nuns try to force her to become a good girl. However, after a few days in forced piety, Rumiko (now Sister Lucia) discovered that her sins were nothing in comparison with those of other Sisters, and Mother Superior's.",
        "genre": "Drama",
        "director": "Kōyū Ohara",
        "poster": "https://image.tmdb.org/t/p/w500/72XT8lKRcAKtXcMWSp044WGszZq.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Mutual Relations",
        "year": "2015",
        "description": "Ho-kyeong, Joo-yeong and Yeon-hee are students of an American university who are all pretty and sexy. They either know too much or know too little so they decide to find men who can satisfy them. A lean man who was a former nude model, a younger man who has perfect techniques and a man who thinks very highly of women; these guys start the project!",
        "genre": "Comedy, Romance",
        "director": "Kim Hyeon-Bin",
        "poster": "https://image.tmdb.org/t/p/w500/k8dsPTp1Ga67c0Ie00qyR3vcPG3.jpg",
        "category": "movies",
        "reason": "Keyword: nude"
    },
    {
        "title": "Fifty Shades of Grey",
        "year": "2015",
        "description": "When college senior Anastasia Steele steps in for her sick roommate to interview prominent businessman Christian Grey for their campus paper, little does she realize the path her life will take. Christian, as enigmatic as he is rich and powerful, finds himself strangely drawn to Ana, and she to him. Though sexually inexperienced, Ana plunges headlong into an affair -- and learns that Christian's true sexual proclivities push the boundaries of pain and pleasure.",
        "genre": "Drama, Romance, Thriller",
        "director": "Sam Taylor-Johnson",
        "poster": "https://image.tmdb.org/t/p/w500/63kGofUkt1Mx0SIL4XI4Z5AoSgt.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Anora",
        "year": "2024",
        "description": "A young sex worker from Brooklyn gets her chance at a Cinderella story when she meets and impulsively marries the son of an oligarch. Once the news reaches Russia, her fairytale is threatened as his parents set out to get the marriage annulled.",
        "genre": "Drama, Comedy, Romance",
        "director": "Sean Baker",
        "poster": "https://image.tmdb.org/t/p/w500/cgXk2tNYhJZLXdBDO5DidAVzQ82.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Sirāt",
        "year": "2025",
        "description": "A man and his son arrive at a rave lost in the mountains of Morocco. They are looking for Marina, their daughter and sister, who disappeared months ago at another rave. Driven by fate, they decide to follow a group of ravers in search of one last party, in hopes Marina will be there.",
        "genre": "Drama, Thriller, Music",
        "director": "Oliver Laxe",
        "poster": "https://image.tmdb.org/t/p/w500/bzBtsLi17rK4G6kDvOXfUZfAhca.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Playing with Love",
        "year": "1977",
        "description": "Laura and Fabrizio have been meeting every summer in the forest by her parent's summer home. Fabrizio is a solitary boy with only his dog for company; Laura a sweet but unconfident child. This summer new aspects enter into their story as both are growing up. Laura is falling in love with Fabrizio, while he displays a new sexual awareness of her masked by his malice. Things develop further when they meet Sylvia who, unlike the innocent Laura, is confident and assertive. Fabrizio develops a fascination with her, eventually bribing Laura to fetch her to the forest to join them in play.",
        "genre": "Drama",
        "director": "Pier Giuseppe Murgia",
        "poster": "https://image.tmdb.org/t/p/w500/nu5uj47KSF73VPEiIRYdPLJ96j7.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Young Hearts",
        "year": "2024",
        "description": "14-year-old Elias increasingly feels like an outsider in his village. When he meets his new neighbour of the same age, Alexander, Elias is confronted with his burgeoning sexuality.",
        "genre": "Drama, Romance",
        "director": "Anthony Schatteman",
        "poster": "https://image.tmdb.org/t/p/w500/iGCtYxfuvXfy0BD5m6p7vKuPOxS.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Eyes Wide Shut",
        "year": "1999",
        "description": "After Dr. Bill Harford's wife, Alice, admits to having sexual fantasies about a man she met, Bill becomes obsessed with having a sexual encounter. He discovers an underground sexual group and attends one of their meetings -- and quickly discovers that he is in over his head.",
        "genre": "Drama, Thriller, Mystery",
        "director": "Stanley Kubrick",
        "poster": "https://image.tmdb.org/t/p/w500/knEIz1eNGl5MQDbrEAVWA7iRqF9.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "My Sister in Law",
        "year": "1976",
        "description": "Intransigent magistrate Viola Orlando is targeted by her rivals who set her twin sister Rosa — a high-class prostitute and pornographic photo-novel star — up to impersonate Viola and demolish her reputation. To complicate things even further, Viola is torn between enforcing the law or giving up her seat on the bench to marry her childhood friend.",
        "genre": "Comedy",
        "director": "Lucio Fulci",
        "poster": "https://image.tmdb.org/t/p/w500/1C73JoBvAryD2mwA3wqdajfJb22.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Uncle David",
        "year": "2010",
        "description": "Ashley, a young man with a childlike mind arrives to stay with his uncle, David. Escaping from his abusive mother, He enters into a sexual relationship with his uncle who offers his insights into the world and the nature of reality. Eventually he tells his uncle that he wants to die, and the latter agrees to carry out the killing.",
        "genre": "Horror, Drama, Thriller",
        "director": "David Hoyle",
        "poster": "https://image.tmdb.org/t/p/w500/uoqnS7rt2NJKHs2ULBaVKaqQ9kn.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Swingers",
        "year": "2002",
        "description": "Despite Diana's insecure nature, she and her husband Julian agree with the idea to sexually experiment with another couple. They put out an ad on the net to which the well experienced Alex and Timo react. We follow Diana and Julian as they prepare for the arrival of Alex and Timo, who they have invited to their home for the weekend. Diana is nervous. As soon as she is confronted with the self-confident and ravishingly sexy Alex, her insecurity increases even more. Timo seems disinterested, a sharp contrast to the boyish excitement of Julian. But as night falls and their sexual exploration begins, we notice Timo may not be as casual as he initially seemed and Diana on the other hand contains hidden strength. And so we realize there's more to 'Swingers' than just sex. Swingers: could your relationship stand the test?",
        "genre": "Romance, Drama",
        "director": "Stephan Brenninkmeijer",
        "poster": "https://image.tmdb.org/t/p/w500/vsctdCbDHApN003Fs3QzJB8Nl9B.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "It Follows",
        "year": "2015",
        "description": "A young woman is followed by an unknown supernatural force after a sexual encounter.",
        "genre": "Horror, Mystery",
        "director": "David Robert Mitchell",
        "poster": "https://image.tmdb.org/t/p/w500/iwnQ1JH1wdWrGYkgWySptJ5284A.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Pleasure",
        "year": "2021",
        "description": "19 year old Linnéa leaves her small town in Sweden and heads for Los Angeles with the aim of becoming the world's next big porn star, but the road to her goal turns out to be bumpier than she imagined.",
        "genre": "Drama",
        "director": "Ninja Thyberg",
        "poster": "https://image.tmdb.org/t/p/w500/TcOsu6iO5prSJbDn9oIQgIW655.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Rose Bluelight",
        "year": "1989",
        "description": "Two girls with homosexual tendencies decide to open the luxury brothel \"Rose Blue Light\". Then, one of them has a brush with the law, and she gets hopelessly smitten by the investigating policewoman's beauty.",
        "genre": "Drama",
        "director": "Lorenzo Onorati",
        "poster": "https://image.tmdb.org/t/p/w500/fIu0HDDEUSzuQOVUUTiQiYIrJlM.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Spermageddon",
        "year": "2025",
        "description": "Two narrative threads: one is an emerging love story between awkward teens Jens and Lisa, who are having sex for the first time; the other, an eventful quest of Simon the Semen and his friends to reach the golden goal, the Egg.",
        "genre": "Animation, Adventure, Fantasy, Comedy",
        "director": "Tommy Wirkola",
        "poster": "https://image.tmdb.org/t/p/w500/n7SFxle8CVzMXzfV8GNCXqdg78m.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Bone Lake",
        "year": "2025",
        "description": "A couple’s romantic vacation at a secluded lakeside estate is upended when they are forced to share the mansion with a mysterious and attractive couple. In this darkly hilarious and seductive horror story, a dream getaway spirals into a nightmarish maze of sex, lies, and manipulation, bringing terrifying secrets to light and triggering a bloody battle for survival.",
        "genre": "Horror, Thriller, Mystery",
        "director": "Mercedes Bryce Morgan",
        "poster": "https://image.tmdb.org/t/p/w500/sGo5ti82LlydAZrvcsaj31iPuEI.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "xXx: Return of Xander Cage",
        "year": "2017",
        "description": "Xander Cage is left for dead after an incident, though he secretly returns to action for a new, tough assignment with his handler Augustus Gibbons.",
        "genre": "Action, Adventure, Crime",
        "director": "D.J. Caruso",
        "poster": "https://image.tmdb.org/t/p/w500/hba8zREJpP1AYhaXgb2oJLQeO0K.jpg",
        "category": "movies",
        "reason": "Keyword: xxx"
    },
    {
        "title": "The Girl Next Door",
        "year": "2004",
        "description": "Exceptionally ambitious high schooler Matthew has aspirations for a career in politics when he falls in love with his gorgeous 19-year-old neighbor, Danielle. But Matthew's bright future is jeopardized when he finds Danielle was once a porn star. As Danielle's past catches up with her, Matthew's love for her forces him to re-evaluate his goals.",
        "genre": "Comedy, Romance",
        "director": "Luke Greenfield",
        "poster": "https://image.tmdb.org/t/p/w500/6uJw7DiPTCDC7VKjMH3FQuA72sc.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Don Jon",
        "year": "2013",
        "description": "A New Jersey guy dedicated to his family, friends, and church, develops unrealistic expectations from watching porn and works to find happiness and intimacy with his potential true love.",
        "genre": "Romance, Comedy, Drama",
        "director": "Joseph Gordon-Levitt",
        "poster": "https://image.tmdb.org/t/p/w500/uh8bwvgGXeUKzdL4oSul9zxyTcd.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Sex and the City",
        "year": "2008",
        "description": "A New York writer on sex and love is finally getting married to her Mr. Big. But her three best girlfriends must console her after one of them inadvertently leads Mr. Big to jilt her.",
        "genre": "Comedy, Drama, Romance",
        "director": "Michael Patrick King",
        "poster": "https://image.tmdb.org/t/p/w500/AhNfnsGW95RKHQNLdgFH48UN0Zy.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "WTF!",
        "year": "2017",
        "description": "Three years ago, twenty-two year old \"girl-next door\" Rachel barely survived a brutal massacre that left all of her friends murdered. Time has passed, and Rachel has moved on, but unfortunately her close friends are spending Spring Break in a secluded house in the woods, and they have cordially invited her to join. She would never have accepted the invitation if she realized that another bloodbath would be showing up as plus one. Once Rachel and her friends arrive at the cabin, the partying, sex, and...terror begins. From girls' only pillow fights to debauchery in a bedroom, it's going to be a blast...aside from the stabbing, flesh melting, and castration. Seven friends will go into a secluded house for the best Spring Break of their lives, but only one will be alive to post about it on Facebook the next week, as Rachel's biggest fears become a reality once again! Can Rachel survive another bloody massacre?",
        "genre": "Horror",
        "director": "Peter Herro",
        "poster": "https://image.tmdb.org/t/p/w500/aDloQdsFgA6WhlFeoJej8rNxthA.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "In the Realm of the Senses",
        "year": "1976",
        "description": "A passionate telling of the story of Sada Abe, a woman whose affair with her master led to an obsessive and ultimately destructive sexual relationship.",
        "genre": "Drama, Romance",
        "director": "Nagisa Ōshima",
        "poster": "https://image.tmdb.org/t/p/w500/AiFQbgjgSXWPfbi9iIYT39iXWMW.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Rockers",
        "year": "2003",
        "description": "Guitarist Ko-chan is a mess of sexual repression after a childhood at the mercy of two elder sisters eager to use him as a guinea pig for their make-up skills. Bassist Gaku-chan keeps a bucket in the wings for whenever his nerves get the better of him, and drummer Momo-chan is doomed to forever carrying the botched childhood attempts at self-tattooing. It's not until this foursome is forced to look for an additional guitar player after Jin's dad burns his Stratocaster, that attitude and musical ability enter into the equation. Leather-clad, shade-wearing Tani (Tamaki), inseparable from his black Les Paul, is introduced as the king of R'n'R cool and Jinnai keeps him firmly seated on his throne throughout the film, retroactively proclaiming the guitarist, rather than himself, as the band's true hero.",
        "genre": "Drama, Action, Comedy, Music",
        "director": "Takanori Jinnai",
        "poster": "https://image.tmdb.org/t/p/w500/qM5pp5ul87a5Amv4g6lZTPHl6RF.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Principles of Lust",
        "year": "2003",
        "description": "Crippled by his writer's block, Paul enters into a new, exciting relationship with risk-taking Billy and super-sexy Juliette. As it becomes increasingly tangled, however, he must choose one of them over the other.",
        "genre": "Drama",
        "director": "Penny Woolcock",
        "poster": "https://image.tmdb.org/t/p/w500/5EH7sX7aWWWQZhZpcfFSSjNoVnb.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Trailer Park Jesus",
        "year": "2012",
        "description": "Jessie deals with a bad breakup, by purchasing a sheet of acid to share with his friends back home in Missouri. He hopes this will erase the bad memory of his college girlfriend, delivering the heartbreaking news to him, during sex. Departing New Orleans, Jessie detours onto Route 61, seeking a change of routine from the monotony of the Interstate. Unexpectedly, his engine fails at a forgotten trailer park in Cleveland, Mississippi. Fearful he's about to be harmed by bikers, Jessie exchanges hits of L.S.D. for safe passage home. During the ebb and flow of the day, Jessie experiences the extraordinary in the pedestrian, whilst resurrecting the lives of many. Inspired by a true misadventure.",
        "genre": "Comedy, Romance",
        "director": "Sean Gerowin",
        "poster": "https://image.tmdb.org/t/p/w500/OPNJpovtS1vAavD1YEdhiVhUcM.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Book Club",
        "year": "2018",
        "description": "Four lifelong friends decide that their lives could change by becoming nasty and reading Fifty Shades of Grey in their monthly book club to get inspiration on how to handle sexual pleasure at an elderly age.",
        "genre": "Romance, Comedy, Drama",
        "director": "Bill Holderman",
        "poster": "https://image.tmdb.org/t/p/w500/6ORGBbOA45pfKQXvntPf46NoFGO.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Naked Gun 33⅓: The Final Insult",
        "year": "1994",
        "description": "Frank Drebin is persuaded out of retirement to go undercover in a state prison. There he has to find out what top terrorist, Rocco, has planned for when he escapes. Adding to his problems, Frank's wife, Jane, is desperate for a baby.",
        "genre": "Comedy, Crime",
        "director": "Peter Segal",
        "poster": "https://image.tmdb.org/t/p/w500/p0AYsdgkudR9P5fNV5AjzbwQt8W.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Honey",
        "year": "2003",
        "description": "Honey Daniels dreams of making a name for herself as a hip-hop choreographer. When she's not busy hitting downtown clubs with her friends, she teaches dance classes at a nearby community center in Harlem, N.Y., as a way to keep kids off the streets. Honey thinks she's hit the jackpot when she meets a hotshot director casts her in one of his music videos. But, when he starts demanding sexual favors from her, Honey makes a decision that will change her life.",
        "genre": "Music, Drama, Romance",
        "director": "Bille Woodruff",
        "poster": "https://image.tmdb.org/t/p/w500/gnY6d7BoddAAQ8s42fxCJK8lL1A.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Predators",
        "year": "2025",
        "description": "In the mid-aughts, Dateline NBC’s To Catch a Predator drew millions of weekly viewers to watch sting operations: men planning to meet minors for sex would instead be confronted by polished host Chris Hansen, then by the police — all on hidden camera.",
        "genre": "Documentary",
        "director": "David Osit",
        "poster": "https://image.tmdb.org/t/p/w500/epjqcM33F3PKRZmj3KbpsXlJ3gY.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Sex",
        "year": "2026",
        "description": "An intimate evening between two teenagers is shaken when their emotions, lusts and secret desires collide with the need to capture everything on a mobile phone camera.",
        "genre": "Drama",
        "director": "Andrej Tomin",
        "poster": "https://image.tmdb.org/t/p/w500/ou09poSnfrnBQeKk1tKW2FcgTeP.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Virgin Territory",
        "year": "2007",
        "description": "In Black Death era Tuscany, as in the Decameron, ten young Florentines take refuge from the plague. But instead of telling stories, they have lusty adventures, bawdy exchanges, romance, swordplay, randy nuns, Saracen pirates, and a sexy cow.",
        "genre": "Adventure, Action, Comedy, Romance",
        "director": "David Leland",
        "poster": "https://image.tmdb.org/t/p/w500/zofWP7ZKhoVTh2VUltaDo4LRQXc.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Batman Returns",
        "year": "1992",
        "description": "The monstrous Penguin, who dwells in the sewers beneath Gotham, joins up with corrupt mayoral candidate Max Shreck to topple the Batman once and for all. But when Shreck's timid assistant Selina Kyle finds out, and Shreck tries to kill her, she's transformed into the sexy Catwoman. She teams up with the Penguin and Shreck to destroy Batman, but sparks fly unexpectedly when she confronts the caped crusader.",
        "genre": "Action, Fantasy",
        "director": "Tim Burton",
        "poster": "https://image.tmdb.org/t/p/w500/jKBjeXM7iBBV9UkUcOXx3m7FSHY.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "XXXXXXX",
        "year": "2016",
        "description": "A tarot card reading as a starting point.  A disruptive relationship as a point.  Translation of the cards' symbols to a joint.\r Of the domestic exploration for finding my voice.",
        "genre": "Documentary",
        "director": "Liliana Colombo",
        "poster": "https://image.tmdb.org/t/p/w500/vHwkMU0gKTDlg5A5kdgvcwKLtP3.jpg",
        "category": "movies",
        "reason": "Keyword: xxx"
    },
    {
        "title": "Unfaithful",
        "year": "2002",
        "description": "Connie is a wife and mother whose 11-year marriage to Edward has lost its sexual spark. When Connie literally runs into handsome book collector Paul, he sweeps her into an all-consuming affair. But Edward soon becomes suspicious and decides to confront the other man.",
        "genre": "Thriller, Drama, Romance",
        "director": "Adrian Lyne",
        "poster": "https://image.tmdb.org/t/p/w500/bjiHEhuiwhIygzjczbTPAA07cGc.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Hot Girls Wanted",
        "year": "2015",
        "description": "A first-ever look at the realities of the professional “amateur” porn world and the steady stream of 18-to-19-year old girls entering into it.",
        "genre": "Documentary",
        "director": "Ronna Gradus",
        "poster": "https://image.tmdb.org/t/p/w500/75ot83QOkc02vujyzmIbumQCU6Y.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Secretary",
        "year": "2002",
        "description": "A young woman, recently released from a mental hospital, gets a job as a secretary to a demanding lawyer, where their employer-employee relationship turns into a sexual, sadomasochistic one.",
        "genre": "Romance, Drama, Comedy",
        "director": "Steven Shainberg",
        "poster": "https://image.tmdb.org/t/p/w500/mdRXSE7ho185SZlXj0JSwuecEd3.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "When Harry Met Sally...",
        "year": "1989",
        "description": "Sex always gets in the way of friendships between men and women. At least, that's what Harry Burns believes. So when Harry meets Sally Albright and a deep friendship blossoms between them, Harry's determined not to let his attraction to Sally destroy it. But when a night of weakness ends in a morning of panic, can the pair avoid succumbing to Harry's fears by remaining friends and admitting they just might be the perfect match for each other?",
        "genre": "Comedy, Romance, Drama",
        "director": "Rob Reiner",
        "poster": "https://image.tmdb.org/t/p/w500/rFOiFUhTMtDetqCGClC9PIgnC1P.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Police Academy",
        "year": "1984",
        "description": "New rules enforced by the Lady Mayoress mean that sex, weight, height and intelligence need no longer be a factor for joining the Police Force. This opens the floodgates for all and sundry to enter the Police Academy, much to the chagrin of the instructors. Not everyone is there through choice, though. Social misfit Mahoney has been forced to sign up as the only alternative to a jail sentence and it doesn't take long before he falls foul of the boorish Lieutenant Harris. But before long, Mahoney realises that he is enjoying being a police cadet and decides he wants to stay... while Harris decides he wants Mahoney out!",
        "genre": "Comedy, Crime",
        "director": "Hugh Wilson",
        "poster": "https://image.tmdb.org/t/p/w500/qxUkWoFI7rF1KUgTgbE3UJEQuvG.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Booty Call",
        "year": "1997",
        "description": "Rushon is sexually pent-up and ready to take thing things to the next level with his girlfriend, Nikki. But when he calls for a date, she asks to make it a double — bringing along her brash friend, Lysterine, whom Rushon sets up with his lewd buddy, Bunz. Things go better than expected. As the evening transitions from the restaurant to the bedroom, the two men go on a madcap search for what will surely make the night complete: condoms.",
        "genre": "Comedy",
        "director": "Jeff Pollack",
        "poster": "https://image.tmdb.org/t/p/w500/1pQpHVm3AXIwbBUnwGEQ0q95E0L.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Love Strange Love",
        "year": "1982",
        "description": "A man remembers forty-eight crucial hours in his life when, as a child, he visited his mother, the favorite woman of an important politician, in a bordello owned by him, right before some important political changes in 1937 Brazil. In those hours, he discovers his own sexuality.",
        "genre": "Drama, History",
        "director": "Walter Hugo Khouri",
        "poster": "https://image.tmdb.org/t/p/w500/9CNnxpI6H8ynyOlACRc25vqgJBY.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Melissa P.",
        "year": "2005",
        "description": "An adolescent girl, living with her mother and her grandmother, will have her first sexual experiences in a heavy and excessive way.",
        "genre": "Drama",
        "director": "Luca Guadagnino",
        "poster": "https://image.tmdb.org/t/p/w500/3fjMLEVozmApiiDF75dnpSIaYZ3.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Summers of It – Chapter One: You'll Float Too",
        "year": "2019",
        "description": "This documentary focuses on the actors and their journey over two summers to create the remake to the original IT, by Stephen King. The documentary originally released as bonus material, bundled with IT: Chapter Two.",
        "genre": "Documentary",
        "director": "Constantine Nasr",
        "poster": "https://image.tmdb.org/t/p/w500/awFM888QgS0PB3SZXMD5HikNXNQ.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "The 40 Year Old Virgin",
        "year": "2005",
        "description": "Andy Stitzer has a pleasant life with a nice apartment and a job stamping invoices at an electronics store. But at age 40, there's one thing Andy hasn't done, and it's really bothering his sex-obsessed male co-workers: Andy is still a virgin. Determined to help Andy get laid, the guys make it their mission to de-virginize him. But it all seems hopeless until Andy meets small business owner Trish, a single mom.",
        "genre": "Comedy, Romance",
        "director": "Judd Apatow",
        "poster": "https://image.tmdb.org/t/p/w500/mVeoqL37gzhMXQVpONi9DGOQ3tZ.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Intimacy",
        "year": "2001",
        "description": "Failed musician Jay abandoned his family and now earns a living as head bartender in a trendy London pub. Every Wednesday afternoon, a woman comes to his house for graphic, almost wordless, sex. One day, Jay follows her and learns about her. This eventually disrupts their relationship.",
        "genre": "Romance, Drama, Fantasy",
        "director": "Patrice Chéreau",
        "poster": "https://image.tmdb.org/t/p/w500/aiPhBVo2eNhuPw5Pezx4BHagvUx.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Cuckold",
        "year": "2009",
        "description": "The Cuckold is a controversial dramatic feature that pushes a camera lens through the peephole of American taboo, focusing on the flashpoint where racial and sexual tensions collide. While set against the backdrop of a little-known fetish in the swinging lifestyle called 'cuckolding', The Cuckold tells the broader story of two suburban couples and two urban men whose lives collide in a tale woven together by the threads of deceit, lust, and primal vengeance. It also explores the consequences and risks in looking beyond the skin in search of love.",
        "genre": "Drama",
        "director": "Jonathan Butler",
        "poster": "https://image.tmdb.org/t/p/w500/jVmPxOzuWfxY93MSsSq1qnbNDeF.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Wrongfully Accused",
        "year": "1998",
        "description": "Ryan Harrison, a violin god, superstar and sex symbol does not want to cheat on sexy Lauren Goodhue's husband with her. Mr. Goodhue is found murdered and Ryan suddenly finds himself being the main suspect. After being sentenced to death he manages to flee while being transferred to his execution site. Now, all the world is after him as he stumbles from one unfortunate incident to the next in order to prove himself innocent - by finding a mysterious one-eyed, one-armed, one-legged man...",
        "genre": "Action, Adventure, Comedy",
        "director": "Pat Proft",
        "poster": "https://image.tmdb.org/t/p/w500/6FG3aldS4eVD4baKwmAi9P8kdRS.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Bodily Sanctions",
        "year": "2001",
        "description": "Three guys decide to spend a few days at a club where they find nothing but beautiful girls, since one of them has just got married. As soon as they get there, they decide to spice up their: the men make a $2000 bet for the person who achieves the most goals, which consist of having sex with women in jacuzzi tubs, having sex with two women at once, and more.",
        "genre": "Romance",
        "director": "Rachel Gordon",
        "poster": "https://image.tmdb.org/t/p/w500None",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Curiosa",
        "year": "2019",
        "description": "A passionate love story set against a backdrop of sexual freedom, loosely based on the relationship between 19th century authors Pierre Louÿs and Marie de Régnier.",
        "genre": "Drama, History",
        "director": "Lou Jeunet",
        "poster": "https://image.tmdb.org/t/p/w500/fxHchovLxOnH65Eel3fAHr9i4Qi.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Bāhubali: The Epic",
        "year": "2025",
        "description": "When a mysterious child is found by a tribal couple near a roaring waterfall, they raise him as their own. As he grows, Sivudu is drawn to the world beyond the cliffs, where he discovers the ancient kingdom of Mahishmati, ruled by a cruel tyrant, haunted by rebellion, and bound to his past. What begins as a quest for love soon unravels a legacy of betrayal, sacrifice, and a forgotten prince.",
        "genre": "Action, Drama",
        "director": "S. S. Rajamouli",
        "poster": "https://image.tmdb.org/t/p/w500/4sLSorDKKDN944kWngxgQlpdDeg.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "The Housemaid",
        "year": "2025",
        "description": "Trying to escape her past, Millie Calloway accepts a job as a live-in housemaid for the wealthy Nina and Andrew Winchester. But what begins as a dream job quickly unravels into something far more dangerous—a sexy, seductive game of secrets, scandal, and power.",
        "genre": "Mystery, Thriller",
        "director": "Paul Feig",
        "poster": "https://image.tmdb.org/t/p/w500/cWsBscZzwu5brg9YjNkGewRUvJX.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Moonlight",
        "year": "2016",
        "description": "The tender, heartbreaking story of a young man’s struggle to find himself, told across three defining chapters in his life as he experiences the ecstasy, pain, and beauty of falling in love, while grappling with his own sexuality.",
        "genre": "Drama",
        "director": "Barry Jenkins",
        "actors": "Trevante Rhodes\nAndré Holland\nJanelle Monáe\nAshton Sanders\nJharrel Jerome\nNaomie Harris\nMahershala Ali",
        "poster": "https://image.tmdb.org/t/p/w500/qLnfEmPrDjJfPyyddLJPkXmshkp.jpg",
        "category": "Movie",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Dog",
        "year": "2013",
        "description": "The Dog (also known as Storyville: The Great Sex Addict Heist[1][2]) is a 2013 documentary film co-written and co-directed by Allison Berg and Frank Keraudren, about the real-life story of bisexual bank robber John Wojtowicz that inspired the 1975 Al Pacino movie Dog Day Afternoon about his August 1972 attempted heist and 14-hour televised hostage situation in Brooklyn to pay for his lover's sex-reassignment surgery.",
        "genre": "Documentary",
        "director": "Allison BergFrank Keraudren",
        "actors": "John WojtowiczCarmen BifulcoJeremy Bowker",
        "poster": "https://image.tmdb.org/t/p/w500/sgaFoabatyHxumdzTKSw6AAKdmQ.jpg",
        "category": "Movie",
        "reason": "Keyword: sex"
    },
    {
        "title": "Harry Potter and the Deathly Hallows – Part 2",
        "year": "2011",
        "description": "As the battle between the forces of good and evil in the wizarding world escalates, Harry Potter draws ever closer to his final confrontation with Voldemort.",
        "genre": "Adventure, Family, Fantasy",
        "director": "David Yates",
        "actors": "Daniel Radcliffe\nRupert Grint\nEmma Watson\nHelena Bonham Carter\nRobbie Coltrane\nWarwick Davis\nRalph Fiennes\nMichael Gambon\nJohn Hurt\nJason Isaacs\nGary Oldman\nAlan Rickman\nMaggie Smith\nDavid Thewlis\nJulie Walters",
        "poster": "https://image.tmdb.org/t/p/w500/c54HpQmuwXjHq2C9wmoACjxoom3.jpg",
        "category": "Movie",
        "reason": "Foreign Characters"
    },
    {
        "title": "No Strings Attached",
        "year": "2011",
        "description": "Emma is a busy doctor who sets up a seemingly perfect arrangement when she offers her best friend Adam a relationship with one rule: No strings attached. But when a fling becomes a thing, can sex friends stay best friends?",
        "genre": "Comedy, Romance",
        "director": "Ivan Reitman",
        "poster": "https://image.tmdb.org/t/p/w500/9C09L1U9S13J4Ut029Qhu0oLcTQ.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Night",
        "year": "2016",
        "description": "Martin moves around Buenos Aires at night, picking up guys, going to clubs, scoring drugs and having sex. Sometimes he’s paying and sometimes his trans sex-worker friend or another woman takes him along for a threesome.",
        "genre": "Drama",
        "director": "Edgardo Castro",
        "poster": "https://image.tmdb.org/t/p/w500/ahygCXFxNGVurcob8J8wE1AHQP1.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Dr. Alien",
        "year": "1989",
        "description": "When the mysterious and sexy Ms. Xenobia takes over the biology class at the local college, the dating life of supergeek Wesley Littlejohn takes a serious turn. Littlejohn agrees to be a lab rat for the professor's unusual vitamin research study. Now, thanks to some out-of-this-world supplements, he's been transformed into the campus stud. But Xenobia has ulterior extraterrestrial motives in this sci-fi sex comedy.",
        "genre": "Comedy, Science Fiction",
        "director": "David DeCoteau",
        "poster": "https://image.tmdb.org/t/p/w500/wl1psbkbE3PXcnFzlO1cW2eLg9t.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Loving Annabelle",
        "year": "2007",
        "description": "Annabelle is the wise-beyond-her-years newcomer to an exclusive Catholic girls school. Having been expelled from her first two schools she's bound to stir some trouble. Sparks fly though when sexual chemistry appears between her and the Head of her dorm and English teacher, Simone Bradley. Annabelle pursues her relentlessly and until the end the older woman manages to avoid the law.",
        "genre": "Drama, Romance",
        "director": "Katherine Brooks",
        "poster": "https://image.tmdb.org/t/p/w500/ezgUinJ6bH0xOWQTqPpb0b7qzE6.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Žena pro tři muže",
        "year": "1980",
        "description": "At the beginning is a suicide attempt by sculptor Jiří Malek, which is foiled by a thief hidden in his apartment. Malek is thirty-five, divorced, caring for his five-year-old son, and the reason he turned on the gas in his studio is, of course, his wife. Mr. Karas, who takes care of Málka's household, tries to get rid of his gloomy mood by using alcohol. But after Jiří insults the old man and they break up badly, Málka's older brother Oldřich decides to find a woman who would be a good wife to Jiří, a mother to little Martin and a good friend to him. She should be pretty, intelligent, understanding, love children and be able to cook, wash and clean. To avoid any mistake, Oldrich will draw up a test, the results of which should decide. Without suspecting that he is undergoing an important test, a number of potential sisters-in-law find themselves in the studio - Edita, a radio editor, Martina, a nurse, Pavla, a student, and others...",
        "genre": "Comedy",
        "director": "Jaroslav Papoušek",
        "poster": "https://image.tmdb.org/t/p/w500None",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Going Places",
        "year": "1974",
        "description": "Two whimsical, aimless thugs harass and assault women, steal, murder, and alternately charm, fight, or sprint their way out of trouble. They take whatever the bourgeoisie holds dear, whether it’s cars, peace of mind, or daughters. Marie-Ange, a jaded, passive hairdresser, joins them as lover, cook, and mother confessor. She’s on her own search for seemingly unattainable sexual pleasure.",
        "genre": "Comedy, Drama",
        "director": "Bertrand Blier",
        "poster": "https://image.tmdb.org/t/p/w500/1evmnMMSgUXORoECRwiMiqjwmN.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "xXx: State of the Union",
        "year": "2005",
        "description": "Darius Stone's criminal record and extreme sports obsession make him the perfect candidate to be the newest XXX agent. He must save the U.S. government from a deadly conspiracy led by five-star general and Secretary of Defense George Deckert.",
        "genre": "Action, Adventure, Crime, Thriller",
        "director": "Lee Tamahori",
        "poster": "https://image.tmdb.org/t/p/w500/9Bmvsv11yf4eIHRePul7sFO1Oh.jpg",
        "category": "movies",
        "reason": "Keyword: xxx"
    },
    {
        "title": "Sextuplets",
        "year": "2019",
        "description": "Father-to-be Alan is shocked to learn that he was born a sextuplet. With his newfound brother Russell riding shotgun, the duo sets out on a hilarious journey to reunite with their remaining long-lost siblings.",
        "genre": "Comedy",
        "director": "Michael Tiddes",
        "poster": "https://image.tmdb.org/t/p/w500/ztGSEcowBoHyRwcK0s5kIKVVXwy.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "How to Lose a Guy in 10 Days",
        "year": "2003",
        "description": "It's the battle of wills, as Andie needs to prove she can dump a guy in 10 days, whereas Ben needs to prove he can win a girl in 10 days. Now, the clock is ticking—and the wildly entertaining comedy smash is off and running in this irresistible tale of sex, lies and outrageous romantic fireworks!",
        "genre": "Comedy, Romance",
        "director": "Donald Petrie",
        "poster": "https://image.tmdb.org/t/p/w500/2dlftyPz7mTYbrsPvTogyFmYd7d.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "BU・SU",
        "year": "1987",
        "description": "Mugiko, an 18-year-old attempts to escape her unhappiness with village life by going to Tokyo to live and work in the geisha house run by her aunt. The daughter of a once great geisha, Mugiko is entitled by blood to train in the geishas ancient art of classical Japanese song and dance.",
        "genre": "Drama",
        "director": "Jun Ichikawa",
        "poster": "https://image.tmdb.org/t/p/w500/tfIoo9GIbhgHpmF7B2UpQLh0jIL.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "The Nice Guys",
        "year": "2016",
        "description": "A private eye investigates the apparent suicide of a fading porn star in 1970s Los Angeles and uncovers a conspiracy.",
        "genre": "Comedy, Crime, Action",
        "director": "Shane Black",
        "poster": "https://image.tmdb.org/t/p/w500/clq4So9spa9cXk3MZy2iMdqkxP2.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Barely Legal",
        "year": "2003",
        "description": "Teenager Deacon works at a video shop, and his buddies, Fred and Matt, sell the bootleg porno films he acquires. Deacon gets fired, but the pals have the bright idea of filming their own Internet porn flick in order to make money and become more popular at school. Hijinks ensue as they cast and create their movie, but porn industry player Vic Ramalot grows jealous of their burgeoning success and tries to put a stop to the project.",
        "genre": "Comedy",
        "director": "David Mickey Evans",
        "poster": "https://image.tmdb.org/t/p/w500/AnIzmcJbe6caNCbe5kTqVQPos5V.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Bohyně krásy",
        "year": "1984",
        "description": "The pre-Christmas period in a household with four small, temperamental children creates a comedy in itself. But when problems with the password lock are added to the confusion, the fun is guaranteed. A busy father of a family buys one of these ingenious gadgets. This invention is supposed to make it impossible for his children to constantly search for Christmas presents. The tense atmosphere and the interplay of random circumstances mean that even trivial problems begin to take on completely different dimensions in the mother's eyes. The previously trusting wife interprets her husband's chess training, mysterious phone calls.... And to make matters worse, the father forgets the password to the lock. Everything culminates when the wife discovers a present under the tree that was probably intended for another woman. However, the mysteries are not solved until New Year's Eve, when - surprise surprise - the mother-in-law intervenes in the story.",
        "genre": "Comedy",
        "director": "František Filip",
        "poster": "https://image.tmdb.org/t/p/w500/ymdxHnLYX32fYsDYlREN2dk5uZe.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "All Stars",
        "year": "1997",
        "description": "Seven young men who played soccer together since their early youth grow apart and are forced to think about the nature of their friendship. In a comic way and a very Dutch setting, All Stars is about pregnant girlfriends and homosexuality, career plans and the power of parents.",
        "genre": "Drama, Comedy",
        "director": "Jean van de Velde",
        "poster": "https://image.tmdb.org/t/p/w500/7iF6qvTRIVafyqxlcZCIZEfRxxn.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "9 Songs",
        "year": "2004",
        "description": "Matt, a young glaciologist, soars across the vast, silent, icebound immensities of the South Pole as he recalls his love affair with Lisa. They meet at a mobbed rock concert in a vast music hall - London's Brixton Academy. They are in bed at night's end. Together, over a period of several months, they pursue a mutual sexual passion whose inevitable stages unfold in counterpoint to nine live-concert songs.",
        "genre": "Drama, Music, Romance",
        "director": "Michael Winterbottom",
        "poster": "https://image.tmdb.org/t/p/w500/91O7z0vo7MiNWd5xD2BoivwbQsb.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Velociraptor",
        "year": "2014",
        "description": "During the end of the world, two best friends walk around their city, talking about their sex lives, and one of them reveals they are still a virgin.",
        "genre": "Comedy, Drama, Fantasy",
        "director": "Chucho E. Quintero",
        "poster": "https://image.tmdb.org/t/p/w500/mGuQBdevB7q2JK6PMqYjCVrXN8W.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "American Fetish",
        "year": "2010",
        "description": "When the son of an alleged killer inherits a \"blue movie\" that may be the key to solving a 50 year old murder, he finds himself drawn into a forbidden world of sexual obsession. But the closer he gets to the heart of the mystery, the more the past threatens to reach out into the present and reveal terrifying truths that lead him to the brink of madness.",
        "genre": "Mystery, Thriller, Crime",
        "director": "Michael Simmons",
        "poster": "https://image.tmdb.org/t/p/w500/9BJDDi7aNoMVfOrQxB8ZJ5ABqcC.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Aşk Sadece Bir An",
        "year": "2025",
        "description": "A young man and woman from very different backgrounds fall in love but their relationship faces obstacles from his troubled past and her overprotective parents.",
        "genre": "Romance, Drama",
        "director": "Mustafa Kotan",
        "poster": "https://image.tmdb.org/t/p/w500/rwiMs8Lr6FAjvXEiQzTJyxLqZee.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Lie with Me",
        "year": "2005",
        "description": "Happily unattached, the sexually voracious Leila satisfies her desires with a host of rapidly changing bed partners, unconcerned about the emotional consequences. But that all changes when she meets an artist looking for a deeper commitment.",
        "genre": "Drama",
        "director": "Clement Virgo",
        "poster": "https://image.tmdb.org/t/p/w500/qG2KYlTxTZbKcXJHMe1OG7aI4un.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "American Virgin",
        "year": "2009",
        "description": "A Freshman College Girl on a scholarship from an abstinence group that advocates saving sex until marriage discovers that her antics on a night of debauchery, when she reluctantly got drunk for the first time in her life, were captured on camera by a sleazy video producer. Now she and her friends must travel across country to recover the incriminating footage.",
        "genre": "Comedy",
        "director": "Clare Kilner",
        "poster": "https://image.tmdb.org/t/p/w500/qvWZ4j8aM9s8tuc6JH2OWdkDFP5.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Getting Played",
        "year": "2005",
        "description": "Three smart and sexy friends, Andrea, Lauren and Emily, are fed up with being played by the men in their lives. To prove that all men are predictable and easily seduced, this hot trio decides to play by a new set of rules. They enter into a wild game of seduction to convince one lucky man that he's living the dream... but what the girls don't realize is  their mark is on to their game and he's got a few plays of his own. Can the girls win? Or, will this player's double play end their game?",
        "genre": "Comedy, Romance",
        "director": "David Silberg",
        "poster": "https://image.tmdb.org/t/p/w500/3bK0BRVyO96qe5BOI3Lla0E9oko.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Y Tu Mamá También",
        "year": "2001",
        "description": "In Mexico, two teenage boys and an attractive older woman embark on a road trip and learn a thing or two about life, friendship, sex, and each other.",
        "genre": "Drama, Romance",
        "director": "Alfonso Cuarón",
        "poster": "https://image.tmdb.org/t/p/w500/aj3rqjab8jfc2fWmcS3H3c5qbur.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Something's Gotta Give",
        "year": "2003",
        "description": "When perpetually single, aging music industry exec Harry Sanborn, and his latest trophy girlfriend, Marin, arrive at her mother's beach house in the Hamptons, they find that her mother, playwright Erica Barry, also plans to stay for the weekend. Erica is scandalized by the relationship and Harry's sexist ways. But when Harry has a heart attack while there, and the doctor prescribes bedrest, his only option is to stay at the Barry home. Left in the care of Erica and his doctor, a love triangle starts to take shape.",
        "genre": "Drama, Comedy, Romance",
        "director": "Nancy Meyers",
        "poster": "https://image.tmdb.org/t/p/w500/1cpdqe0SpiHzzbOLq9GDUUlZdSl.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Virtual Sexuality",
        "year": "1999",
        "description": "A frustrated teenage girl creates her perfect man in a virtual reality machine and in a freak accident, gives him life.",
        "genre": "Comedy, Science Fiction, Drama",
        "director": "Nick Hurran",
        "poster": "https://image.tmdb.org/t/p/w500/lMx1firCTM9gs7kVxyRKjHx56Lm.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Lady Ninja: Reflections of Darkness",
        "year": "1996",
        "description": "A sexy squad of female ninja assassins is hired by a ruthless magistrate to exterminate his former lovers, who threaten to ruin his reputation. Battles erupt with a hilarious mix of martial arts and magic--all in the line of duty.",
        "genre": "Action, Comedy, History",
        "director": "Masaru Tsushima",
        "poster": "https://image.tmdb.org/t/p/w500/rzZdbGs4c3QnY8DzO0gezJeKVM3.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "L♡DK: Two Loves Under One Roof",
        "year": "2019",
        "description": "Aoi Nishimori and Shūsei Kugayama are in love and they begin to live together secretly. Suddenly, Shūsei's cousin, Reon Kugayama, comes to them. Their secret is discovered by Reon. Now, Aoi, Shūsei, and Reon begin to live together.",
        "genre": "Romance",
        "director": "Taisuke Kawamura",
        "poster": "https://image.tmdb.org/t/p/w500/8L66hJyXptS9XBt5b4O7WkZuwYj.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Acı Hayat",
        "year": "1962",
        "description": "Poor welder Mehmet and manicurist Nermin, who works in a high society hair salon, fall in love. When Nermin is obsessively haunted by a spoiled rich guy, their unadulterated love is disrupted.",
        "genre": "Drama, Romance",
        "director": "Metin Erksan",
        "poster": "https://image.tmdb.org/t/p/w500/768HBw6xsNFKPAPg9fyBQsxwM1q.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Řád",
        "year": "1994",
        "description": "Set in 1776, this historical film by Petr Hvizd concerns an army deserter who takes refuge within the walls of the Convent of St. Claire. The investigation to find him soon becomes a question of morality concerning the value of human life in the context of the diversity and hierarchy of social laws.",
        "genre": "Drama, History",
        "director": "Petr Hvižď",
        "poster": "https://image.tmdb.org/t/p/w500None",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Sleepers",
        "year": "1996",
        "description": "Two gangsters seek revenge on the state jail worker who during their stay at a youth prison sexually abused them. A sensational court hearing takes place to charge him for the crimes.",
        "genre": "Crime, Drama, Thriller",
        "director": "Barry Levinson",
        "poster": "https://image.tmdb.org/t/p/w500/yUpiEk2EojS9ZEXb3nIQonQCYYF.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Casanova",
        "year": "2005",
        "description": "With a reputation for seducing members of the opposite sex, regardless of their marital status, a notorious womanizer discovers a beauty who seems impervious to his charms. However, as he continues to pursue the indifferent lady, he finds himself falling in love.",
        "genre": "Adventure, Comedy, Drama, Romance",
        "director": "Lasse Hallström",
        "poster": "https://image.tmdb.org/t/p/w500/pp237jqOnlLojQfvCgJHv5yZofL.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Warrior Queen",
        "year": "1987",
        "description": "In ancient Pompeii, slaves are bought and sold for household chores and sex. A mysterious queen moves among the elite, meantime secretly helping the slaves to escape. Eventually her life is also in jeopardy, and as the volcano erupts she and the slaves attempt to escape while being chased by the military.",
        "genre": "Action, History, Adventure",
        "director": "Chuck Vincent",
        "poster": "https://image.tmdb.org/t/p/w500/P0j17mJRpSIZOglbtPkakHSD1S.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Hacı Murat",
        "year": "1967",
        "description": "Russian giaour destroy the whole town and kill the entire Muslim people and Seyh Samil imposes duty to Haci Murad to fight against the whole giaour.",
        "genre": "Adventure, Action, History",
        "director": "Natuk Baytan",
        "poster": "https://image.tmdb.org/t/p/w500/tWRRq8Q1DPE0rdzazcVRlgW9SQY.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Young Mother 4",
        "year": "2016",
        "description": "Woo-jin, who is a repeater of college entrance exam, and Taek-sik's friend, Kang-hee come and visit Woo-jin's hometown on a small island. Woo-jin's mom, Hyeon-sook operates a small sashimi restaurant and a bed and breakfast to make a living on the island. Although Hyeon-sook has sex with Bong-seong, she rejects his proposals. One day, Woo-jin is terribly shocked to accidentally see his mom Hyeon-sook and Bong-seong having sex.",
        "genre": "Romance",
        "director": "Kim Hyo-jae",
        "poster": "https://image.tmdb.org/t/p/w500/UsQC34yh6U7oAUdRn2nMDNXbwf.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Bambola",
        "year": "1996",
        "description": "Her name is Mina, but she is called Bambola (doll). Upon the death of her mother, she and her homosexual brother, Flavio, open a pizzeria. A man named Ugo loans Bambola the money, but is then killed in a fight with another one of her boyfriends, Settimio. While visiting Settimio in jail, she meets a sadistic man named Furio, and they begin a relationship.",
        "genre": "Comedy, Drama",
        "director": "Bigas Luna",
        "poster": "https://image.tmdb.org/t/p/w500/8o2xRDWl9DTmSTpdLCN0GHl9zqJ.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "El Peste",
        "year": "2018",
        "description": "Abner lives a drab, downcast, solitary existence. His wife has abandoned him for good. Working for pest control company Panther, his job remains his sole connection to the outside world. It seems going nowhere until he meets Viola, a client who is existence is as sad as his. Wife of a vain college teacher Dodie, Viola is a trapped bird. And meeting Abner seems to give her a chance to fly free. The house, infested with rats all around, becomes a powder keg of emotions and danger as sexual tension between Abner and Viola turns to illicit affair, all happening under Dodie’s nose. In order to extend their relationship, Abner devices something that will eventually lead to a tragedy that will change their lives forever.",
        "genre": "Drama, Horror",
        "director": "Richard Somes",
        "poster": "https://image.tmdb.org/t/p/w500/9BZmj1XYgW08jMk5151vMAJMnP0.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "L'immoralità",
        "year": "1978",
        "description": "Federico is a child-killer running from the law. Wounded, he is taken in by an 11 year old girl named Simona. Their strange love affair is interrupted by Simona's depressed, oversexed mother Vera, who concocts a plan with Federico to kill her wheelchair-bound, reclusive husband. Simona does not take kindly to this new relationship between Federico and Vera.",
        "genre": "Drama, Thriller",
        "director": "Massimo Pirri",
        "poster": "https://image.tmdb.org/t/p/w500/g1oAr3BFG5nKILdJ9ICeRqdZHpM.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Covet: Island of Desire",
        "year": "2017",
        "description": "People who are on a fishing boat in a secluded countryside wake up to a deep desire in their heart.  Money, sex, power ... In the uninhabited desert of endless desire, it turns out that somebody is found as a body and another person is on the island.  Can they escape safely from the island of desire?",
        "genre": "Romance",
        "director": "Kim Jin-sung",
        "poster": "https://image.tmdb.org/t/p/w500/zNebLQ3O2BNNI1qCDqTRCzxJTrS.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Kiss",
        "year": "1965",
        "description": "When a dying man receives a kiss from a bereaved man who tries to save him, the man is jailed as a homosexual. He is released from jail, but his life has been ruined by the incident -- and the man eventually is killed by his own father-in-law. The kiss that resulted in the eventual persecution and death of the man is never shown in this plodding, downbeat drama.",
        "genre": "Drama",
        "director": "Flávio Tambellini",
        "poster": "https://image.tmdb.org/t/p/w500/5t5tVHsT8jOWSe9TOvAk1rIA6zR.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "About Cherry",
        "year": "2012",
        "description": "18-year-old Angelina shuffles between school, a dead-end job, her exploitative boyfriend, and home, where her life consists of cleaning up after her alcoin holic mother and protecting her younger sister from their menacing stepfather. After arranging an escape to San Francisco with her best friend Andrew, she soon finds herself dating a coke-addicted attorney and becoming immersed in the local porn industry, mentored by lesbian director Margaret, who has more than just a professional interest in Angelina's talents.",
        "genre": "Drama",
        "director": "Stephen Elliott",
        "poster": "https://image.tmdb.org/t/p/w500/gl6Q7GwDnwHDNd1emmQBoyUKiwB.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Already Dead",
        "year": "1998",
        "description": "A young pizza-deliverer, Andréa, introduces Laure, a 20 year old girl he barely knows, to his friend David, a wealthy layabout who is looking for models for his porn photo agency. Eager for an easy escape from her dull life, Laure agrees to attend an audition with David’s boss, who proposes that she appears in hard core porn videos. She does not realise - until it is too late - that she has entered a world of hedonistic excess and brutal self-destruction...",
        "genre": "Crime, Drama",
        "director": "Olivier Dahan",
        "poster": "https://image.tmdb.org/t/p/w500/qn2TlpBTrmlP0dzxbLzU2ulL4Qw.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Not Me!",
        "year": "1996",
        "description": "In this Canadian psychological drama a repressed young man struggles with his phobia of sex. It began when he was a sensitive 11-year old awakened in the night by the sound of his parents making love. Not understanding the nature of the groans, he peeks in and is horrified by the sight. Things get worse the next day when he and his mother discover that daddy died in his sleep that night. The boy, confused by it all deduces that it was the sex-act that killed his father and so refuses to mature so he will never have to die. This goes on several years and for some reason his mother doesn't seem to mind. Things seem okay until his mom's new boy friend moves in. The teen and the lover constantly fight. Late at night, the boy begins spying on his mother and the man and in so doing comes to realize that sex is not as deadly as it seemed. Once this light dawns, the boy is able to grow up and become normal.",
        "genre": "Drama",
        "director": "Pierre Gang",
        "poster": "https://image.tmdb.org/t/p/w500/8vAnRk0KfIi80Cg0QYhlEJjZUVP.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "American Virgin",
        "year": "2000",
        "description": "When your father is a pornographer, what can you do to shock him? If you're Katrina Bartalotti, you announce that you're going to lose your virginity -- live on the Internet, for the whole world to see.",
        "genre": "Comedy",
        "director": "Jean-Pierre Marois",
        "poster": "https://image.tmdb.org/t/p/w500/ipmJipuIgcnfA0KcO2xGQcUSOYf.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Amor Bandido",
        "year": "2021",
        "description": "Joan is a naïve, 16-year-old who falls in love easily. One day he decides to escape to the provinces with Luciana, a beautiful 35-year-old woman and a teacher at his school, in order to give free rein to his love. Soon, Joan discovers with horror that he has fallen into a trap that is a mix between sex, money, politics and violence.",
        "genre": "Thriller, Romance, Drama",
        "director": "Daniel Werner",
        "poster": "https://image.tmdb.org/t/p/w500/qb3YySysqo8ikQoagBIz29BZOmi.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Fatma Bacı",
        "year": "1972",
        "description": "The film tells the story of a family who moves from a village to the city. Fatma moves to Istanbul after her husband is killed in a blood feud. There, she starts working as a doorkeeper in an apartment building. Her eldest daughter, Halime, is in a relationship with Rıza, a wealthy married man. Her younger daughter Ayşe, who is studying fine arts, is ashamed of her mother's job as a janitor. Her son Yusuf, on the other hand, is determined to avenge his father's death. He waits for Mahmut, the man who killed his father, to be released from prison. While Fatma tries to protect her daughters, she also struggles to convince Yusuf to abandon the blood feud.",
        "genre": "Drama",
        "director": "Halit Refiğ",
        "poster": "https://image.tmdb.org/t/p/w500/A1A0kNOOu3oVN0h1XkBxIEUhHlb.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Dìdi (弟弟)",
        "year": "2024",
        "description": "In 2008, during the last month of summer before high school begins, an impressionable 13-year-old Taiwanese American boy learns what his family can't teach him: how to skate, how to flirt, and how to love your mom.",
        "genre": "Comedy, Drama",
        "director": "Sean Wang",
        "poster": "https://image.tmdb.org/t/p/w500/3UCTNaZgxW6BbeHMMTe6uL07MpV.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "The Doctors",
        "year": "1978",
        "description": "There is everything in this hospital, a good doctor, one who only wants money, one with sexual perversions and the director who hides everything.",
        "genre": "Drama",
        "director": "Fernando Ayala",
        "poster": "https://image.tmdb.org/t/p/w500/1RFvWfPue3xYzEUfQSO26aaC6XO.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Female Scorpion",
        "year": "1986",
        "description": "Those involved in the making of an amateur porn video end up getting slashed to death with a cane sword. It's up to the brave policewoman Eugenia aka The Scorpion (Maribel Guardia) to stop him.",
        "genre": "Horror",
        "director": "María Luisa Alcalá",
        "poster": "https://image.tmdb.org/t/p/w500/l03Z4EFjMbrB1346Fzb4BEsQart.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Disobedience",
        "year": "2018",
        "description": "New York photographer Ronit flies to London after learning about the death of her estranged father. Ronit is returning to the same Orthodox Jewish community that shunned her decades earlier for her childhood attraction to Esti, a female friend. Their fortuitous and happy reunion soon reignites their burning passion as the two women explore the boundaries of faith and sexuality.",
        "genre": "Drama, Romance",
        "director": "Sebastián Lelio",
        "poster": "https://image.tmdb.org/t/p/w500/skPT4ffWhlmmDOMNEdxOiP6Emfz.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "XXY",
        "year": "2007",
        "description": "Alex, an intersexed 15-year-old, is living as a girl, but she and her family begin to wonder whether she's emotionally a boy when another teenager's sexual advances bring the issue to a head. As Alex faces a final decision regarding her gender, she meets both hostility and compassion.",
        "genre": "Drama",
        "director": "Lucía Puenzo",
        "poster": "https://image.tmdb.org/t/p/w500/4sgoignnXhqjxepHBi2inLFLhSz.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "L♡DK",
        "year": "2014",
        "description": "Aoi Nishimori's parents moved to another city for work, but Aoi didn't want to transfer to a new high school. She stays behind and lives in an apartment by herself. Shūsei Kugayama moves in next to Aoi's apartment. Shūsei is a very popular student at their high school. Due to a mistake, Aoi makes the sprinkler go off in his room. Until Shūsei's room is fixed, he stays with Aoi.",
        "genre": "Comedy, Drama, Romance",
        "director": "Taisuke Kawamura",
        "poster": "https://image.tmdb.org/t/p/w500/eG9DY0msm6s1rTedBjql0Nmv4WL.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "The Visitor",
        "year": "2024",
        "description": "London, today. A refugee washes up naked in a suitcase on the bank of the Thames. The enigmatic, sexually fluid stranger introduces himself to a bourgeois, upper-class family, who invite him to stay on as an employee. The Visitor soon seduces each member in a series of explicit sexual encounters. He will turn their world upside down as they can redefine themselves in new, radical ways.",
        "genre": "Comedy",
        "director": "Bruce LaBruce",
        "poster": "https://image.tmdb.org/t/p/w500/3GAax3lDVyDOpOk81GW4RVvCdwl.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Consent",
        "year": "2010",
        "description": "A wealthy Manhattan family's inability to cope with the suicide of their eldest daughter sends them into a downward spiral of drugs, alcohol and sexual taboos that threatens to destroy them.",
        "genre": "Drama",
        "director": "Ron Farrar Brown",
        "poster": "https://image.tmdb.org/t/p/w500/5RhXH9dkYUp51FApJxVdhi4fXdR.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Blue Jean",
        "year": "2023",
        "description": "Jean, a PE teacher, is forced to live a double life. When a new student arrives and threatens to expose her sexuality, Jean is pushed to extreme lengths to keep her job and her integrity.",
        "genre": "Drama",
        "director": "Georgia Oakley",
        "poster": "https://image.tmdb.org/t/p/w500/8kzhsiL340IDeaAuEz4RfiFilgf.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Imagine Me & You",
        "year": "2006",
        "description": "During her wedding ceremony, Rachel notices Luce in the audience and feels instantly drawn to her. The two women become close friends, and when Rachel learns that Luce is a lesbian, she realizes that despite her happy marriage to Heck, she is falling for Luce. As she questions her sexual orientation, Rachel must decide between her stable relationship with Heck and her exhilarating new romance with Luce.",
        "genre": "Drama, Comedy, Romance",
        "director": "Ol Parker",
        "poster": "https://image.tmdb.org/t/p/w500/a7CbxY3TMwFKX6awlBxhb7Es6tS.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Supreme Champion",
        "year": "2010",
        "description": "SUPREME CHAMPION is a fun, sexy, stylized and fast paced fight action thriller about honor and courage featuring eight world class mixed martial arts champions.",
        "genre": "Action, Thriller",
        "director": "Ted Fox",
        "poster": "https://image.tmdb.org/t/p/w500/g05dWZRv5GWTTeLjK9G3B9cYW1v.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Female Perversions",
        "year": "1997",
        "description": "Eve Stephens, a beautiful and sexy high-powered attorney, is up for appointment as a judge. But below her veneer of self-confidence lies a darker side, one in which she is driven by bizarre visions and sexual fantasies. After a series of events, including rescuing her sister Madelyn after her arrest for shoplifting, being rejected by her lover John during a surprise visit, and finally, meeting with the Governor regarding her judicial appointment, Eve comes unraveled. In a stunning and climactic conclusion, Eve is forced to confront her fears and, more importantly, herself.",
        "genre": "Drama, Romance, Thriller",
        "director": "Susan Streitfeld",
        "poster": "https://image.tmdb.org/t/p/w500/5vqRaOZBqBL1YXukRv6zI6Y4pxC.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Lover Boy",
        "year": "1975",
        "description": "A young man gets a pleasant surprise when a comely \"relative\" agrees to teach him the rudiments of sex.",
        "genre": "Comedy",
        "director": "Marino Girolami",
        "poster": "https://image.tmdb.org/t/p/w500/xscW9qzVbuKbjUxF6CY3OsY8h6m.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Půlnoční kolona",
        "year": "1973",
        "description": "A group of soldiers is supposed to ensure the smooth nighttime passage of the military convoy through Prague, but things turn out differently. Eloquent young men convince the good-natured commander to sign a leave of absence, and the main character is left alone in the middle of a housing estate...",
        "genre": "Comedy",
        "director": "Ivo Novák",
        "poster": "https://image.tmdb.org/t/p/w500/iMNrk1pZM7K3d5QNLrS8A27phih.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Swinging Safari",
        "year": "2018",
        "description": "1975: A 200-ton blue whale gets washed up on a local beach and the kids think it’s the biggest thing that’s ever happened in Australia. Behind closed doors, the Mums and Dads of a quiet suburban street are going to celebrate in their own special way, by joining the sexual revolution and throwing a wife-swapping key party.  And like the rotting whale, it’s all about to go spectacularly wrong.",
        "genre": "Comedy, Drama",
        "director": "Stephan Elliott",
        "poster": "https://image.tmdb.org/t/p/w500/zs9wcNHidBPhcTmiWzXuFam823v.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Das Menschenmögliche",
        "year": "2019",
        "description": "Judith is a doctor who is very committed to her profession. Aiming to become a cardiologist, she performs part of her residency in a chronically understaffed hospital emergency room. During a particularly difficult shift, she makes a mistake that causes the death of a patient. Judith is devastated and doubts whether she is suited to the profession. Her fellow doctors, including her partner Mark, advise her to just carry on as before. While Judith’s actions are investigated, she is assigned to ambulance duty. Being in a new environment and having some distance to the clinical routine allow her to see things in a new light.",
        "genre": "Drama",
        "director": "Eva Wolf",
        "poster": "https://image.tmdb.org/t/p/w500/zMp1UhOeVlWylGDzHKmgBHSMM9M.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Bula",
        "year": "2022",
        "description": "A woman working in a laundry shop uses her clients' clothes to satisfy her sexual fantasies. When she meets a hot police officer, she wants to have him no matter what it takes.",
        "genre": "Thriller, Horror",
        "director": "Bobby Bonifacio",
        "poster": "https://image.tmdb.org/t/p/w500/rGLUh7cjJe7xUPzG9SOgGiyArgm.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Yuvasız Kuşlar",
        "year": "1979",
        "description": "A rich girl bets on getting a Turkish folk singer to fall in love with her and marry her in return for an expensive prize. But the bet at the end turns into a love story she didn't count on...",
        "genre": "Drama, Music, Romance",
        "director": "Natuk Baytan",
        "poster": "https://image.tmdb.org/t/p/w500/z6the3wI2m9c7O5KeTpyXSdF1SS.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Scorned 2",
        "year": "1997",
        "description": "Amanda Foley has confusing nightmares and flashbacks that lead her to seek professional help. Nothing can shed light on her repressed memories, until she happens to catch her husband a college professor, having sex with one of his students. Then the past becomes dangerously clear",
        "genre": "Thriller, Drama",
        "director": "Rodney McDonald",
        "poster": "https://image.tmdb.org/t/p/w500/84MubqpvKFu3octXdPmb3SbgoWW.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Montreal Main",
        "year": "1974",
        "description": "An open and honest autobiographical account of male sexuality centered on Frank, an unemployed photographer, and his circle of mainly gay friends. He and his best friend, Bozo, attempt to have sex, although they consider themselves straight. But things begin to fall apart when Frank meets and falls in love with Johnny, a 13-year-old boy.",
        "genre": "Drama",
        "director": "Frank Vitale",
        "poster": "https://image.tmdb.org/t/p/w500/urfdCi791q5dCGUY4FLdOkcXxab.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Our Fathers",
        "year": "2005",
        "description": "In the '80s, priests and especially the Father Geoghan arrested for sexual abuse of minors. Cardinal Law, also indicted, and the diocese was aware of the actions of these men of the church and was kept secret for years, until the victims decide to seek redress.",
        "genre": "Drama, History, TV Movie",
        "director": "Dan Curtis",
        "poster": "https://image.tmdb.org/t/p/w500/bq9Ct0JZWXdcHa3Ijsj9eFmgnzX.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Room Salon College Girls",
        "year": "2018",
        "description": "Sexy female college students get part-time jobs at a room salon and provide very special services.",
        "genre": "Romance",
        "director": "Jo Tae-ho",
        "poster": "https://image.tmdb.org/t/p/w500/xIGPD1QQzxIwRJc55ThQjZpD3tT.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Hard Copy",
        "year": "2023",
        "description": "Charlotte, a young reporter eager for promotion, is commissioned to write a newspaper article about a wild sex club in London. Overcoming her inhibitions, she joins the scene and finds herself falling for Simon, a charming but manipulative man who seduces her with an ulterior motive.",
        "genre": "Thriller",
        "director": "Daniel Fooley",
        "poster": "https://image.tmdb.org/t/p/w500/rmeFSzjQKlFQ5Arwh7UGu23odAM.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Caged Women",
        "year": "1980",
        "description": "A bunch of delinquent women are shipped to an island prison run by the sadistic warden Carla. Forced into situations of sexual perversion and violence and torture, the prisoners band together to try to overthrow Carla and escape the island.",
        "genre": "Action, Adventure, Drama",
        "director": "Erwin C. Dietrich",
        "poster": "https://image.tmdb.org/t/p/w500/dniW5AJ2plixkJ4hn30msMVlwi9.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Veronica 2030",
        "year": "1999",
        "description": "Built for pleasure, Veronica 2030 is a love android from the future - but there's a problem with the programming... The robot has discovered the delicious sensation of human passion. The insatiable android must be stopped before she has a sexual short circuit.",
        "genre": "Science Fiction",
        "director": "Gary Graver",
        "poster": "https://image.tmdb.org/t/p/w500/8DWLpoyQiXs5hq6AfrmaDKHxA12.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Bulls Market",
        "year": "1970",
        "description": "Tom and Ben have a company that’s not doing very well. Their blonde associate, Sheila, however, has a brilliant idea: instead of paying the shareholders cash dividends, why not pay them with sex!?! Sheila then agrees to get some of her friends involved!",
        "genre": "Comedy",
        "director": "Bob Vosse",
        "poster": "https://image.tmdb.org/t/p/w500None",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Mutants",
        "year": "1998",
        "description": "Three homeless teenage rejects struggle to survive together. Of them, Andreia is pregnant, while Pedro and Ricardo hustle, steal and are exploited by a pornographer.",
        "genre": "Drama",
        "director": "Teresa Villaverde",
        "poster": "https://image.tmdb.org/t/p/w500/rav4Yd9zcRhYkjNhTK75q15WnlM.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Shotgun Wedding",
        "year": "1963",
        "description": "While Rafe Anchors longs to marry the daughter of his father's sworn enemy, his father is being pressured into marriage by a sexy, shady gold-digger closer to Rafe's age.",
        "genre": "Drama",
        "director": "Boris Petroff",
        "poster": "https://image.tmdb.org/t/p/w500/msMh2getBsjDxV16caNJdrFcQ8s.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Coming Soon",
        "year": "1999",
        "description": "Privileged teenage friends Jenny, Nell and Stream spend their senior year on a quest to rid Stream of her virginity. However, Stream wants more than just her first sexual experience. She wants to have an orgasm -- but achieving this proves problematic, as the boys she meets are hardly sensitive enough to provide her the release she seeks. When it becomes clear that Nell and Jenny have never experienced an orgasm either, all three set out to get one.",
        "genre": "Romance, Comedy",
        "director": "Colette Burson",
        "poster": "https://image.tmdb.org/t/p/w500/nd3sDcYh7pn7FNaOPvearItL2Yr.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Butcher",
        "year": "1998",
        "description": "Alina is a brilliant and enterprising woman who runs a successful art gallery in Palermo. Her husband Daniele, a successful orchestra conductor, cultured and intelligent, is not a regular presence. One day, while accompanying Daniele to the airport, Alina feels a sense of emptiness. She will try to fill it with a butcher who is always joking and full of erotic allusions and who arouses a strong attraction in her.",
        "genre": "Drama",
        "director": "Aurelio Grimaldi",
        "poster": "https://image.tmdb.org/t/p/w500/jCbZGO0y1oWLY6rPY54ybJ1ARw5.jpg",
        "category": "movies",
        "reason": "Keyword: erotic"
    },
    {
        "title": "Long Live the Seal",
        "year": "1982",
        "description": "Andrea, a nice girl, move from Veneto (north of Italy) to Roma. She is employed as a nurse in a medical practice. She soon is involved in a never-ending game of misunderstanding, couples exchange, sexual seductions.",
        "genre": "Comedy",
        "director": "Nando Cicero",
        "poster": "https://image.tmdb.org/t/p/w500/ehFKpF7wnQvjqPZ9ldz0lGJcuRf.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Sandwich",
        "year": "2023",
        "description": "A newly wed couple invites a woman for threesome. Unknown to them someone is watching their sexcapade. When the threesome becomes foursome, that's when chaos begins.",
        "genre": "Drama",
        "director": "Jao Daniel Elamparo",
        "poster": "https://image.tmdb.org/t/p/w500/aHCwT1InO29aFibhmONnpJnjaj8.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Zero 2",
        "year": "2010",
        "description": "What would you get if you mix a gangster film and a soap opera? \"Zero 2\" is a crazy twister of criminal romance and sexy violence that just might laugh you to death.",
        "genre": "Comedy, Thriller",
        "director": "Emilis Vėlyvis",
        "poster": "https://image.tmdb.org/t/p/w500/6W5MnngYOtVIM9FoE1DBsoI2fgF.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Cannibal Vegetarian",
        "year": "2012",
        "description": "Danko Babic is an ambitious and amoral gynaecologist at Croatia's leading fertility clinic. When his colleague Bantic is appointed as head of the clinic, Babic starts a secret war to overthrow his rival. Distracted by his ruthless campaign he makes series of fatal mistakes that result in the death of a patient. A crooked coroner and a corrupt police officer cover up his misdeeds, while Babic grows increasingly dependant on drugs and alcohol. He begins performing illegal abortions on prostitutes who work for Jedinko, a gangster who controls the local drug and sex trade.",
        "genre": "Drama, Thriller",
        "director": "Branko Schmidt",
        "poster": "https://image.tmdb.org/t/p/w500/opq3sFgD6yCB31qsLznvGoSMq9C.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Sexmission",
        "year": "1984",
        "description": "Two scientists are chosen as guinea pigs for a time experiment: they are placed in hibernation and should be brought back to life after three years. In the meantime, however, World War III breaks out and life has been wiped off the surface of Earth. When they wake up, it turns out that not only 50 years have passed but also that they are the only living specimens of the male sex in a new, underground society composed exclusively of women.",
        "genre": "Science Fiction, Adventure, Comedy",
        "director": "Juliusz Machulski",
        "poster": "https://image.tmdb.org/t/p/w500/8zh3AuXBxGbgtebL5DpaDxJgMeW.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Mixed Doubles",
        "year": "2006",
        "description": "Bored with his sex life, a man tries to convince his wife to swap partners.",
        "genre": "Comedy, Drama, Romance",
        "director": "Rajat Kapoor",
        "poster": "https://image.tmdb.org/t/p/w500/jCv6NWHOx9hf5dBHUoS94lYd1vw.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Love Apprentices",
        "year": "1972",
        "description": "One of the many German \"report\" sexploitation films from the early 1970s, with the only distinction that it focuses on female apprentices instead of schoolgirls.",
        "genre": "Drama, Comedy",
        "director": "Ernst Hofbauer",
        "poster": "https://image.tmdb.org/t/p/w500/65hf3jtIQ5FMzLzwFm1qjprWmCV.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Evil Toons",
        "year": "1992",
        "description": "Four sexy young girls are to clean an old house for the new owners. They get delivered an old book full of magic incantations, and while reading it they accidentally bring a cartoon character to life. The cartoon character likes the blood of young girls...",
        "genre": "Comedy, Horror",
        "director": "Fred Olen Ray",
        "poster": "https://image.tmdb.org/t/p/w500/xCyBph5p7V09csf40hYrfVGoxy3.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Thawing Out",
        "year": "2009",
        "description": "Léo is dragged to a nudist camping resort by his mother. Like most boys at the age of 12 or 13, being nude in public holds little appeal for Léo, who protests by wearing extra layers. Until he meets a certain special girl, who captures his heart and releases his inhibitions.",
        "genre": "Comedy, Drama",
        "director": "Jean-Julien Chervier",
        "poster": "https://image.tmdb.org/t/p/w500/yu2lpgsWZg3u8LrYkM23S0VRHk6.jpg",
        "category": "movies",
        "reason": "Keyword: nude"
    },
    {
        "title": "Puppylove",
        "year": "2013",
        "description": "When a free-spirited girl befriends a young teenager, they leave childhood behind to embrace a dangerous world of clubbing and sex with strange men.",
        "genre": "Romance, Drama",
        "director": "Delphine Lehericey",
        "poster": "https://image.tmdb.org/t/p/w500/mkwHa1MmzMNEnejetEUZW4ZhYxc.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Scared Topless",
        "year": "2015",
        "description": "A group of unsuspecting college students explore a haunted house and get more than they bargained for when the sexual frenzy of the paranormal world reveals itself.",
        "genre": "Comedy, Horror, Mystery, Romance",
        "director": "Jim Wynorski",
        "poster": "https://image.tmdb.org/t/p/w500/3bsTVoTl2UAHSMla8GXFjxf6w21.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Estate",
        "year": "2021",
        "description": "When the spoiled son and newest wife of a billionaire patriarch plot to murder him, they form a psycho-sexual bond with their brutally handsome hitman as they kill and kill (and kill) in their quest for wealth and recognition.",
        "genre": "Comedy, Thriller",
        "director": "James Kapner",
        "poster": "https://image.tmdb.org/t/p/w500/uJmFCDJXYZHL5ArCel1xtQAqb8z.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Zero Woman: The Hunted",
        "year": "1997",
        "description": "A woman with no past or identity, Rei is a gorgeous undercover agent for the Zero Department, a deadly shadow division of the police force. But her skillshave made her a threat and this sleek, sexy assassin has been marked for death by a rival organization. It will take this deadly seductress every ounce of her cunning to survive!",
        "genre": "Drama, Action, Thriller",
        "director": "Norihisa Yoshimura",
        "poster": "https://image.tmdb.org/t/p/w500/rIDoy1mZd76ZBd19L9cr67hVgSB.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Summer '03",
        "year": "2018",
        "description": "16-year-old Jamie Winkle and her extended family are left reeling after her calculating grandmother unveils an array of secrets on her deathbed. As her family deals with her grandmother's surprising dying messages, Jamie sets out to make the most of her summer and explores her sexuality.",
        "genre": "Comedy, Romance",
        "director": "Becca Gleason",
        "poster": "https://image.tmdb.org/t/p/w500/rZhUcUkDzgvF0pjEjMZvUsvcUqH.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Close Call",
        "year": "2004",
        "description": "In Los Angeles, the young Jenny has a nice childhood with her Korean parents Joanne and David Kim. However, after the divorce of her parents, the judge gives her custody to her selfish mother that neglects Jenny while the disappointed David returns to Seoul. Six years later, Jenny is a troubled and reckless teenager expelled from the public school that has easy sex and uses drugs and booze, and her best friend is the orphan drug dealer Becky. The lawyer Elliot Krasner decides to call his former friend David to tell him about the self-destructive behavior of Jenny, and David returns to Los Angeles. He brings Jenny to live with him and support her, but the lack of emotional structure of Jenny imposes tough difficulties for their relationship.",
        "genre": "Drama, Action, Crime",
        "director": "Jimmy Lee",
        "poster": "https://image.tmdb.org/t/p/w500/4Slv2vYyMJGUk1JiuczHyIYhXtN.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Ayrılık",
        "year": "1972",
        "description": "The love between two young people who cling to each other while fleeing from the trouble behind them.",
        "genre": "Drama, Adventure",
        "director": "Türker İnanoğlu",
        "poster": "https://image.tmdb.org/t/p/w500/3B9BxwrUmQwuxgBvJsHjW2IErmd.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Consent",
        "year": "2007",
        "description": "Work colleagues Becky and Steve get drunk at a work party at an up-market hotel and end up having sex. She claims it was rape; he claims it was consensual. A mock trial follows in which a jury of ordinary people, real barristers, solicitors, and a judge hear the resulting case.",
        "genre": "TV Movie, Crime, Drama",
        "director": "Brian Hill",
        "poster": "https://image.tmdb.org/t/p/w500/2eyFhOmstkbsvwzvuZrtKI57cmC.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "How to Have Sex",
        "year": "2023",
        "description": "Three British teenage girls go on a rites-of-passage holiday—drinking, clubbing and hooking up, in what should be the best summer of their lives.",
        "genre": "Drama",
        "director": "Molly Manning Walker",
        "poster": "https://image.tmdb.org/t/p/w500/yQyoFCBLGJH5HXESmJAzaiXw9zU.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Blue Movie",
        "year": "1971",
        "description": "25-year-old Michael has been released from prison after a five-year sentence. He moves into a big apartment block, filled with young women who gladly have sex with him.",
        "genre": "Drama",
        "director": "Wim Verstappen",
        "poster": "https://image.tmdb.org/t/p/w500/7hG1B2pmumMGZhU3WhGp4fnmnVj.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Senza vergogna",
        "year": "1986",
        "description": "A partially paralyzed teenager is failing to have sex for the first time. He's eager but clumsy and sickly, so the local country girls reject him. He starts to realize that the only affectionate person in his life is his beautiful mother.",
        "genre": "Drama",
        "director": "Gianni Siragusa",
        "poster": "https://image.tmdb.org/t/p/w500/kCUbA73Rpwvr5Sw99AU8SjCTjLi.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "HK: Forbidden Super Hero",
        "year": "2013",
        "description": "High school student Kyosuke Shikijo is the most talented member of the school's martial arts of the fist club. His late father was detective and Kyosuke share his father's strong sense of justice. Kyosuke also has a secret. Kyosuke likes to wear female underwear and transforms himself into the alter ego \"Hentai Kamen,\" wearing female underwear and gaining superhuman powers. This unusual interest also comes from his parents, with his father a masochist and his mother a sadist. By chance, Kyosuke gets the underwear of female high school student Aiko Himeno. With her underwear, he gains various pervert techniques and attempts to protect Aiko from a dirty and heinous teacher.",
        "genre": "Action, Comedy",
        "director": "Yuichi Fukuda",
        "poster": "https://image.tmdb.org/t/p/w500/o5ENtNf4uNACilr90RNTIhd2CtU.jpg",
        "category": "movies",
        "reason": "Keyword: hentai"
    },
    {
        "title": "The Influencer",
        "year": "2022",
        "description": "Yexel, an influencer, experiences the best sex of his life when he meets Mina. But their no-label relationship turns to obsession when she learns that he's having sex with other women.",
        "genre": "Thriller, Drama",
        "director": "Louie Ignacio",
        "poster": "https://image.tmdb.org/t/p/w500/5UKoGU3y92k9v319DqxzmZUqxfo.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Cold Spring",
        "year": "2013",
        "description": "Prompted by an almost fatal car accident, Sara and Roy, a married couple, decide to start a new life and move to the small town of Cold Spring. This incident also serves as a wakeup call for Roy who breaks off an affair he's been having with his sexy mistress, Diane. Just as they begin settling into their new life, Diane shows up in Cold Spring and declares that she cannot live without him and has just bought a house in Cold Spring to be near him.",
        "genre": "Thriller",
        "director": "Sheldon Wilson",
        "poster": "https://image.tmdb.org/t/p/w500/a2DC0HR5DBnPJe2qEiHNKghqXxM.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Lovelace",
        "year": "2013",
        "description": "Story of Linda Lovelace, who is used and abused by the porn industry at the behest of her coercive husband, before taking control of her life.",
        "genre": "Drama",
        "director": "Rob Epstein",
        "poster": "https://image.tmdb.org/t/p/w500/ibt7chnBsaDbE6ZVwyneuZwYfsC.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "God, Sex and Truth",
        "year": "2018",
        "description": "'God, Sex and Truth' delves into the world of sex where it digs out and projects the deepest dignity, divinity of the act and a women's true purpose of her sexuality.",
        "genre": "Romance",
        "director": "Ram Gopal Varma",
        "poster": "https://image.tmdb.org/t/p/w500/vaqtTC12oX94ChZUljXRz4fw2ch.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "First stay date Rena Miyashita, holding hands, kissing, laughing, and then forgetting time and getting intertwined",
        "year": "2022",
        "description": "MIDV-118: Dokidoki's flirting love date! Play at the arcade, watch the night view with the Ferris wheel, hold hands with the boys and kiss. A day like youth with laughter! !! After playing outside, we meet closely at the hotel, forgetting the time and seeking SEX! Sweet, violently disturbed and immersed in pleasure many times. The next morning, a staying date that is indecently intertwined. An innocent and innocent cute smile and an ecstatically distorted naughty face all day long! !!",
        "genre": "Documentary",
        "director": "Usapyon.",
        "poster": "https://image.tmdb.org/t/p/w500/eudoBAhUNVFjHoXNNFRUmFSbBUd.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Unwed Father",
        "year": "1997",
        "description": "9 months after a drunken sexual encounter, a young man winds up raising a baby on his own.",
        "genre": "Drama, TV Movie",
        "director": "Michael Switzer",
        "poster": "https://image.tmdb.org/t/p/w500/gKSfMRsmkjduysaz9CncDjaC68q.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Top Model",
        "year": "1988",
        "description": "Gloria works as a top nude model and prostitute, but she has a secret. In reality she is writer and social critic Sarah Asproon researching her new book. Peter finds out and blackmails her by demanding sex for his silence. Meanwhile Sarah develops feelings for computer whiz Cliff, who struggles to resolve his own sexual orientation.",
        "genre": "Drama",
        "director": "Joe D'Amato",
        "poster": "https://image.tmdb.org/t/p/w500/t4zHGClSi7XNHSSFoJSI83jKWkw.jpg",
        "category": "movies",
        "reason": "Keyword: nude"
    },
    {
        "title": "Kahalili",
        "year": "2023",
        "description": "A young woman finds work on a wealthy couple’s farm, but is asked to provide the ultimate service: to serve as a surrogate mother. As her pregnancy progresses, the husband’s growing sexual attachment intensifies.",
        "genre": "Drama",
        "director": "Bobby Bonifacio",
        "poster": "https://image.tmdb.org/t/p/w500/pSUsxJu66G3zeFvBjtNBIaEMnRL.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Disclosure",
        "year": "1994",
        "description": "A computer specialist is sued for sexual harassment by a former lover turned boss who initiated the act forcefully, which threatens both his career and his personal life.",
        "genre": "Thriller, Drama, Crime",
        "director": "Barry Levinson",
        "poster": "https://image.tmdb.org/t/p/w500/1DcDAJ5vM5XKKONmTaadq5GHpfk.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Unspeakable",
        "year": "1996",
        "description": "When Alice Redmond is required to go deep undercover in an effort to trap number one suspect Darren Metlick, she gets very close to the edge. Her superiors push her past the point of no return because they need additional evidence to make their case air tight. Alice is having an affair with a fellow officer Don Holroyd and his sexual appetite closely resembles that of the hacker, so she has some experience in the dark side.",
        "genre": "Mystery, Drama, Horror",
        "director": "Howard McCain",
        "poster": "https://image.tmdb.org/t/p/w500/ApCMWR2jg45lZTGMjN2JIpIwePj.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Bad Santa",
        "year": "2003",
        "description": "You'd better watch out - Santa Claus Willie T. Soke is coming to town, and he doesn't care if you've been naughty or nice. Wille's favorite holiday tradition is to fill his sacks with loot lifted from shopping malls across the country. But this year his plot gets derailed by a wisecracking store detective, a sexy bartender, and a kid who's convinced Willie is the real Santa Claus.",
        "genre": "Drama, Comedy, Crime",
        "director": "Terry Zwigoff",
        "poster": "https://image.tmdb.org/t/p/w500/rfClLIyeHqpMofmrPY8DaLe4z9x.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Love Jones",
        "year": "1997",
        "description": "Darius Lovehall is a young black poet in Chicago who starts dating Nina Moseley, a beautiful and talented photographer. While trying to figure out if they've got a \"love thing\" or are just \"kicking it,\" they hang out with their friends, talking about love and sex. Then Nina tests the strength of Darius' feelings and sets a chain of romantic complications into motion.",
        "genre": "Comedy, Drama, Romance",
        "director": "Theodore Witcher",
        "poster": "https://image.tmdb.org/t/p/w500/7LdKsfON12uEyDEKY9mZASlx8Nf.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Tysiąc talarów",
        "year": "1960",
        "description": "An average notary finds a small fortune of coins hidden in his fireplace alongside a manuscript dating back 100 years.",
        "genre": "Comedy",
        "director": "Stanisław Wohl",
        "poster": "https://image.tmdb.org/t/p/w500None",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Revolution Summer",
        "year": "2007",
        "description": "A portrait of three restless young urbanites searching for meaning in love, sex, drugs, and political revolution.",
        "genre": "Drama",
        "director": "Miles Montalbano",
        "poster": "https://image.tmdb.org/t/p/w500None",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Złote koło",
        "year": "1971",
        "description": "An unknown man brings a wounded boy from a hospital and prompty walks away. The boy soon dies and the militia captain Budny begins an investigation, leading him deep into a web of crime.",
        "genre": "Crime, TV Movie",
        "director": "Stanisław Wohl",
        "poster": "https://image.tmdb.org/t/p/w500/hfE9ghuJ7sctfPzCIc1KuS2dZ3K.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Adult Behaviour… It's All in the Mind",
        "year": "1999",
        "description": "Frank leads a respectable yuppie life working at a noted Stockholm law firm. He has also been married for eight years to his beautiful wife Nenne, who runs an upscale boutique. Yet Frank is deeply bored with his life and is supremely randy. He even fantasizes about the marriage counselor that he and Nenne visit weekly. Eventually, Frank shacks up with a young fetching art student named Sofia, though the experience wracks Frank with guilt. Meanwhile, Nenne's friend and co-worker Rosie suspects that Frank is having an affair, though she does not have the nerve to tell her. Little does Rosie suspect, however, that her friend is sleeping with her lover Georg, an uptight journalist with an ego the size of Finland. Soon wires get crossed, and all hell breaks loose.",
        "genre": "Comedy",
        "director": "Felix Herngren",
        "poster": "https://image.tmdb.org/t/p/w500/ltVU6kHBLWvDdgJ6iEJuNQw1AXg.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Voyeur Confessions",
        "year": "2001",
        "description": "A beautiful student learns voyeurism, and soon find herself sexually obsessed with her own subject.",
        "genre": "Drama",
        "director": "Tom Lazarus",
        "poster": "https://image.tmdb.org/t/p/w500/8cx7RZPH534sohvCkpIFtKFkcCK.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Sexual Life",
        "year": "2005",
        "description": "As they seek romance and sexual gratification, the lives of eight Los Angeles natives — including a teenager, a wedding photographer and a hotel desk clerk — converge on a carousel of carnal encounters.",
        "genre": "Comedy, Drama, Romance",
        "director": "Ken Kwapis",
        "poster": "https://image.tmdb.org/t/p/w500/i99bf24pONTdI07yU0AO3wCyzsH.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Penthouse Playgirls",
        "year": "1972",
        "description": "A gang of white slavers lure beautiful young women into prostitution by staging beauty contests in which the \"prize\" is a Hollywood contract. The \"winners\" are then drugged and sold to international sex traffickers",
        "genre": "Comedy",
        "director": "Erwin C. Dietrich",
        "poster": "https://image.tmdb.org/t/p/w500/5y6US9VKriR3uDkDpLHpVdTHppj.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Live Nude Girls",
        "year": "1995",
        "description": "A group of old friends at a Hens Night discuss their issues, uncertainties, fears and fantasies.",
        "genre": "Comedy",
        "director": "Julianna Lavin",
        "poster": "https://image.tmdb.org/t/p/w500/vg9piYFtCTHep2V5EmLjwsYMzn2.jpg",
        "category": "movies",
        "reason": "Keyword: nude"
    },
    {
        "title": "xxxHOLiC The Movie: A Midsummer Night's Dream",
        "year": "2005",
        "description": "Invited to a wealthy client's mansion, time-traveling witch Yuko and her companions arrive to find a group of collectors assembled to participate in a mysterious auction. And the mystery only deepens when the collectors go missing one by one. As more guests disappear and strange occurrences abound, Yuko and her friends realize they must solve the mystery before they vanish as well.",
        "genre": "Animation, Comedy, Drama, Mystery, Fantasy",
        "director": "Tsutomu Mizushima",
        "poster": "https://image.tmdb.org/t/p/w500/pzIc4K5QS9F7PAjujmDjSokCS4y.jpg",
        "category": "movies",
        "reason": "Keyword: xxx"
    },
    {
        "title": "The Devil’s Trap",
        "year": "2024",
        "description": "In the quiet nighttime corridors of a city hospital, Abigail (Nistratova) consoles her traumatized brother, Billy (Davi) who is now a paraplegic. Billy suffers from horrible nightmares in which he revisits his childhood, where we meet his alcoholic and violent father. Sharing Billy’s hospital room is a dying man, Mr. Cohen (Dern) who seems to know everything about Billy and Abigail. There’s also another horrific presence roaming in the hospital terrifying patients and staff alike.",
        "genre": "Horror, Thriller",
        "director": "Mike Mendez",
        "poster": "https://image.tmdb.org/t/p/w500/deq8OGRj45eX1EFYQayG5T3Prar.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "The Sweetheart",
        "year": "2018",
        "description": "Sex, lies, and deception of a con man.  Heartbroken over her parents breakup and recovering from a car accident, Jane becomes suspicious of her mother’s new boyfriend.",
        "genre": "Drama, Thriller, TV Movie",
        "director": "Max McGuire",
        "poster": "https://image.tmdb.org/t/p/w500/hNJmp5RykddoqZBWiXbU3cmuXef.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Mahcup Delikanlı",
        "year": "1974",
        "description": "The film tells the story of a man who is in love with the brother of a woman with whom he had an affair. Text, returns to Turkey to complete his education in London. So his father holds a party. Alev, who comes to the party, falls in love with Metin. However, Metin does not like Flame. Despite that, they experience a short-term relationship at the insistence of Alev. One day, Metin meets Sema, Alev's sister. They fall in love with each other and are mentioned. Alev, who cannot get Metin, will try to separate Metin with his brother.",
        "genre": "Comedy, Drama",
        "director": "Orhan Aksoy",
        "poster": "https://image.tmdb.org/t/p/w500/kttbGlhdwMt5IsN4HKsO75z9tWU.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Underwater",
        "year": "2015",
        "description": "Battling with his own inner demons, Jonathan is taken to an elite swimming academy deep in the English countryside by his soon to be step-mother. At the academy, Jonathan struggles to find his place among the group. He may be a top athlete in his field, but when it comes to the small world of Lakeside, swimming, sex and chauvinism combine to create something explosive and the potential for something very dangerous. This short movie was produced by extracting the story scenes from the adult movie \"SwimBoy.\"",
        "genre": "Drama",
        "director": "Alejandro Sesma",
        "poster": "https://image.tmdb.org/t/p/w500/iUwtwOlJ52YlclTPaJWupBL3Ye5.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Shame",
        "year": "2011",
        "description": "Brandon, a thirty-something man living in New York, eludes intimacy with women but feeds his deepest desires with a compulsive addiction to sex. When his younger sister temporarily moves into his apartment, stirring up bitter memories of their shared painful past, Brandon's life, like his fragile mind, gets out of control.",
        "genre": "Drama",
        "director": "Steve McQueen",
        "poster": "https://image.tmdb.org/t/p/w500/krrOuyeyopTnqHIVBbcq74qlKkr.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Miss Julie",
        "year": "1951",
        "description": "Based on the play by August Strindberg, Miss Julie vividly depicts the battle of the sexes and classes that ensues when Julie, a wealthy businessman's daughter, falls for Jean, her father's bitter servant.",
        "genre": "Drama, Romance",
        "director": "Alf Sjöberg",
        "poster": "https://image.tmdb.org/t/p/w500/t0FCrjopWvU6rm54WpioTLCUVZc.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Video Vixens!",
        "year": "1975",
        "description": "Video Vixens purports to be a satire of the phony liberalism that resulted in the permissiveness of the 1980s. A libidinous TV executive decides to stage an awards show. But not just any awards show: this one will honor the finest achievements in the world of filmed pornography.",
        "genre": "Comedy",
        "director": "Henri Pachard",
        "poster": "https://image.tmdb.org/t/p/w500/maqet6ABvVMTGk0jWsulg9FWiun.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Yongju Valley",
        "year": "2015",
        "description": "Yong-hwa is a gangster from the Yongju Valley. He is harassed for money by Chairman Kang and in the end decides to start an adult broadcasting system online. With sexy BJ Marshal in the lead, Yong-hwa manages to get a tremendous reaction from the online viewers. BJ Bang-wool becomes jealous of BJ Marshal and soon they start competing...  Will their sexy scandal be a success?",
        "genre": "Drama, Romance",
        "director": "Choi Woo-seong",
        "poster": "https://image.tmdb.org/t/p/w500/z71W04S43PfM4Vdvz3NgGLEF7He.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "HK: Hentai Kamen 2 - Abnormal Crisis",
        "year": "2016",
        "description": "News about the disappearance of panties is still being covered every day. Kyosuke still wears Aiko Completo's panties to battle evil. Meanwhile, Aiko has mixed emotions and decides to get her panties back. Kyosuke suffers from the loss of Aiko's panties and disappears, but his biggest enemy yet is about to materialise.",
        "genre": "Action, Comedy",
        "director": "Yuichi Fukuda",
        "poster": "https://image.tmdb.org/t/p/w500/mvLYHpJCFK0gur7mlrLMA8z2a9F.jpg",
        "category": "movies",
        "reason": "Keyword: hentai"
    },
    {
        "title": "Zeta One",
        "year": "1969",
        "description": "A race of sexy, other-dimensional specimens arrive to Earth to kidnap women to repopulate their planet.",
        "genre": "Comedy, Fantasy, Science Fiction",
        "director": "Michael Cort",
        "poster": "https://image.tmdb.org/t/p/w500/5G7u1B1XlZ1CMyKOp4hvXIOCk5K.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "No End",
        "year": "1985",
        "description": "1982, Poland. A translator loses her husband and becomes a victim of her own sorrow. She looks to sex, to her son, to law, and to hypnotism when she has nothing else in this time of martial law when Solidarity was banned.",
        "genre": "Drama",
        "director": "Krzysztof Kieślowski",
        "poster": "https://image.tmdb.org/t/p/w500/3pdF1guvIxNgmhDkmXJHCCk0PkC.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Kan Kardeşler",
        "year": "1977",
        "description": "The film tells the friendship story of three young people named Ali, Tufan and Selim. Selim is a musician, Ali and Tufan are car mechanics. They live in the same house. Elif, who works as a manicurist, joins the group as Ali's girlfriend. Meanwhile, Tufan meets Mehtap, a rich woman. However, Mehtap's involvement in illegal activities causes trouble for Tufan. Learning about the situation, Elif, Ali and Selim decide to save Tufan from this environment.",
        "genre": "Action, Adventure",
        "director": "Ertem Göreç",
        "poster": "https://image.tmdb.org/t/p/w500/nlDAmLrtvLAjN59pMnrRpWkiimN.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Poison",
        "year": "2001",
        "description": "Seeking revenge for her husband's death, Ann ingratiates herself with the Garretts under the guise of a caring housekeeper. Once she gains their trust, Ann begins to wreak havoc upon the dysfunctional family. Seduction and malice are her weapons as she attempts to emotionally and sexually destroy them.",
        "genre": "Crime, Thriller",
        "director": "Jim Wynorski",
        "poster": "https://image.tmdb.org/t/p/w500/jlXtfsb5IONrtyyTTvVapObFJki.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "0cm⁴",
        "year": "2001",
        "description": "Maeda decides to have an operation to cure his color-blindness, but he becomes afraid that after the operation, his world is not going to be the same.",
        "genre": "Drama",
        "director": "Sion Sono",
        "poster": "https://image.tmdb.org/t/p/w500/wSL0DqWcyxu1wHd8cap9mVGDZ16.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Yalnız Adam",
        "year": "1974",
        "description": "A man trying to solve a murder on his own and losing close friends along the way.",
        "genre": "Action, Thriller",
        "director": "Natuk Baytan",
        "poster": "https://image.tmdb.org/t/p/w500/z8CC4V61WIgGI1zP8J59KtYALdI.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Alpha House",
        "year": "2014",
        "description": "When two freshmen pledges are accepted into the biggest party frat on campus, they think they have it all. That is, until the assistant dean forces the Alphas to share their house with a sorority or face expulsion from school. Not wanting to see their lifelong dream of becoming Alphas destroyed, the pledges convince the other members of the house to take back what's theirs, waging an epic battle of the sexes to fight for their right to party.",
        "genre": "Comedy",
        "director": "Jacob Cooney",
        "poster": "https://image.tmdb.org/t/p/w500/s00AwtusVVG8lpA3fquKaE63NWW.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Fear",
        "year": "1996",
        "description": "Nicole Walker always dreamed of being swept away by someone special — someone strong, sexy and sensitive who would care for her more than anything else in the world. David is all that and more: a modern-day knight who charms and seduces her, body and soul. But her perfect boyfriend is not all he seems to be. His sweet facade masks a savage, dark side that will soon transform Nicole's dream into a nightmare.",
        "genre": "Thriller",
        "director": "James Foley",
        "poster": "https://image.tmdb.org/t/p/w500/ut8snuINzOibbKnvpTnsGWQr4Nl.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Good Hair",
        "year": "2009",
        "description": "An exposé of comic proportions that only Chris Rock could pull off, GOOD HAIR visits beauty salons and hairstyling battles, scientific laboratories and Indian temples to explore the way hairstyles impact the activities, pocketbooks, sexual relationships, and self-esteem of the black community.",
        "genre": "Documentary, Comedy",
        "director": "Jeff Stilson",
        "poster": "https://image.tmdb.org/t/p/w500/ru6vIG2Omq8HKgDBe4o02BtySWz.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Sound of Freedom",
        "year": "2023",
        "description": "The story of Tim Ballard, a former US government agent, who quits his job in order to devote his life to rescuing children from global sex traffickers.",
        "genre": "Action, Drama",
        "director": "Alejandro Monteverde",
        "poster": "https://image.tmdb.org/t/p/w500/qA5kPYZA7FkVvqcEfJRoOy4kpHg.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Kinky Killers",
        "year": "2007",
        "description": "Patients of sexy psychiatrist Dr. Jill Kessey and eccentric attorney Alexander Hathaway are being murdered in bloody, satanic rituals. Law enforcement investigations reveal that sex and mutilation are the signatures of a serial killer, who likes to tattoo each of the victims after they are murdered. Lead detective Barry Harper discovers that some beautiful professional women are the prey...or are they doing the preying?",
        "genre": "Horror, Thriller",
        "director": "George Leković",
        "poster": "https://image.tmdb.org/t/p/w500/drCRYSUBZyJ4gT6XucJLMIMxvVT.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Isadora",
        "year": "1968",
        "description": "A biography of the dancer Isadora Duncan, the 1920s dancer who forever changed people's ideas of ballet. Her nude, semi-nude, and pro-Soviet dance projects as well as her attitudes on free love, debt, dress, and lifestyle shocked the public of her time.",
        "genre": "Drama, History, Music",
        "director": "Karel Reisz",
        "poster": "https://image.tmdb.org/t/p/w500/5NAjQxJgf4BJWz8m2Qj0fryG3bV.jpg",
        "category": "movies",
        "reason": "Keyword: nude"
    },
    {
        "title": "Chlapská čest",
        "year": "1990",
        "description": "Two happily married couple, Michal and Blanka, experience a regrettable misunderstanding: the wife leaves home with their young son, but unfortunately her husband does not find the explanatory letter. Normally, he would wait for the matter to resolve itself, as he does not believe that his wife would just leave him, but he is under a lot of pressure: from his own parents, his neighbor, his mother-in-law, and his \"good friends.\" They all advise him that the only solution is an immediate divorce. After a week, everything is explained, Michal finds Blanka's note and realizes how little he trusted Blanka and how easily he believed others...",
        "genre": "Comedy",
        "director": "Pavlína Moskalyková",
        "poster": "https://image.tmdb.org/t/p/w500None",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Savage Grace",
        "year": "2007",
        "description": "This examination of a famous scandal from the 1970s explores the relationship between Barbara Baekeland and her only son, Antony. Barbara, a lonely social climber unhappily married to the wealthy but remote plastics heir Brooks Baekeland, dotes on Antony, who is homosexual. As Barbara tries to \"cure\" Antony of his sexuality -- sometimes by seducing him herself -- the groundwork is laid for a murderous tragedy.",
        "genre": "Drama",
        "director": "Tom Kalin",
        "poster": "https://image.tmdb.org/t/p/w500/rtJp4ulwC1SvSYAUFGUa1pWV7nk.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Fidelity",
        "year": "2000",
        "description": "A talented photographer who lands a lucrative job in Paris with a scandal-mongering tabloid and becomes romantically involved with an eccentric children's book publisher while resisting the sexual advances of another photographer.",
        "genre": "Drama",
        "director": "Andrzej Żuławski",
        "poster": "https://image.tmdb.org/t/p/w500/3nMKtqNHs69URTAgO85KxELfyn2.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Acı Hayat",
        "year": "1973",
        "description": "Kerem and Ebru are a couple in love. However, their families' centuries-old feud is the biggest obstacle standing in their way. Ebru's family decides to marry her off to Bahri in order to make her forget Kerem. But Kerem and Ebru, who refuse to be separated no matter what, run away on their wedding day.",
        "genre": "Drama, Romance",
        "director": "Orhan Aksoy",
        "poster": "https://image.tmdb.org/t/p/w500/fmHCpWNeBX2bujbutyTjm9ijfo6.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Donkey Punch",
        "year": "2008",
        "description": "Three hot girls, four guys, and one mega-swanky yacht collide for a serious night of drugs and sexual deviancy. One debaucherous act goes too far though, turning this teen joy ride into a weekend of bloody bedlam.",
        "genre": "Horror, Drama, Thriller, Crime",
        "director": "Olly Blackburn",
        "poster": "https://image.tmdb.org/t/p/w500/wd5GVtBRA6gG7CRV6E2VKr7AcT2.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Moxie",
        "year": "2021",
        "description": "Inspired by her mom's rebellious past and a confident new friend, a shy 16-year-old publishes an anonymous zine calling out sexism at her school.",
        "genre": "Comedy, Drama, Music",
        "director": "Amy Poehler",
        "poster": "https://image.tmdb.org/t/p/w500/aLBo1Ca9PggcWY98ItW5ZkdxTuA.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Bliss",
        "year": "1997",
        "description": "On his wedding day, Joseph nervously admits that his wife is not quite like other women. But his beautiful bride is more than just the \"impulsive, compulsive, obsessive\" woman he thinks he knows. And when Joseph discovers she is hiding troubling secrets, it sends them both on a sexual odyssey that will either destroy or redeem their relationship.",
        "genre": "Drama, Romance",
        "director": "Lance Young",
        "poster": "https://image.tmdb.org/t/p/w500/zGdGINvf9oSysprbWnu85dIM7rc.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Jet Trash",
        "year": "2016",
        "description": "Lee and Sol are hiding out on a beach in Southern India living a slacker life of sex, drugs and parties. Trouble comes to paradise when Vix, a beautiful girl from Lee's past, turns up. Things get worse when Lee accidentally kills a holy cow and the gang find themselves up against crooked cops, local hoodlums, gangsters.... and mysticism. How far do you have to go to get away?",
        "genre": "Thriller, Drama",
        "director": "Charles Henri Belleville",
        "poster": "https://image.tmdb.org/t/p/w500/muJo4aYm96jCdL9t3Y22W5ipAb9.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Bel Ami",
        "year": "2012",
        "description": "Georges Duroy travels through 1890s Paris, from cockroach ridden garrets to opulent salons, using his wits and powers of seduction to rise from poverty to wealth, from a prostitute’s embrace to passionate trysts with wealthy beauties, in a world where politics and media jostle for influence, where sex is power and celebrity an obsession.",
        "genre": "Romance, Drama",
        "director": "Nick Ormerod",
        "poster": "https://image.tmdb.org/t/p/w500/59bgVtpX6MPy2d5zberJiRNkDDx.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Sleeping Beauties",
        "year": "2017",
        "description": "Awakened from a curse after 400 years, Sleeping Beauty (Sarah Hunter) marvels at the wonders of the new century. She falls in love with a famous architect who is working to restore the castle she once lived in, but finds there are enemies plotting against her. Giving in to her long pent-up sexual desires, Beauty cannot resist the lustful advances of both men and women and after 400 years, she's ready to explore everything and everyone!",
        "genre": "Fantasy, Comedy",
        "director": "Dean McKendrick",
        "poster": "https://image.tmdb.org/t/p/w500/asvkeRwacvjvoUtlGc715tUQlzB.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "I Am Nevenka",
        "year": "2024",
        "description": "In the year 2000, Nevenka Fernández, 24 years old, Councilor for Finance in the Ponferrada City Council, suffered relentless persecution, both sentimental and professional, by the mayor, a man accustomed to doing his will politically and personally. She never decides to report, although she knows that she will have to pay a very high price: her environment does not support her, the society of Ponferrada turns its back on her and the media subjects her to a public trial. A story inspired by real events that turns its protagonist into a pioneer by taking an influential and popular politician to court for sexual and workplace harassment for the first time.",
        "genre": "Drama, History",
        "director": "Icíar Bollaín",
        "poster": "https://image.tmdb.org/t/p/w500/aE2lnlUhXaD3enmbxAmgGjb3MPS.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Mojo",
        "year": "1997",
        "description": "The sexual rivalries over a new, potentially great rock'n'roll singer between a nightclub owner and a local gangster cause unrest and eventually lead to murder.",
        "genre": "Drama, Crime",
        "director": "Jez Butterworth",
        "poster": "https://image.tmdb.org/t/p/w500/ffbctLbInVKPbd1uUsQb88FvYJR.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Housemaid",
        "year": "2010",
        "description": "Eun-yi is hired as a maid in a mansion owned by a wealthy businessman. He quickly starts seducing his employee who seemingly has little choice but to comply with his sexual advances. Soon the women of the family plot against Eun-yi who must fight an equally devious battle to protect herself.",
        "genre": "Thriller, Drama",
        "director": "Im Sang-soo",
        "poster": "https://image.tmdb.org/t/p/w500/acrlZuaS7ypiEUb3oZRA28Ox7TV.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Annuity",
        "year": "1972",
        "description": "In 1930, Louis Martinet, a peaceful sexagenarian, no longer has a long life to live according to the words of his doctor, Leon Galipeau, who sees to take advantage of the very interesting situation of the \"future deceased\". This one indeed has a small house in Saint-Tropez. Galipeau sniffs the windfall. Following his advice, Martinet agrees to give it in life to the brother of the doctor, Emile, and then rushes back to a health of iron. Worse, he even survives the war. Galipeau, exhausted, decide to use the great means to get rid of the importunce who persists in thwarting their project ...",
        "genre": "Comedy",
        "director": "Pierre Tchernia",
        "poster": "https://image.tmdb.org/t/p/w500/axblx8rNjqvNXH3rolqKkWWUAeq.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Bat Eyes",
        "year": "2012",
        "description": "The confusion of first love, sexual awakening and the poetry of W.B. Yeats explored.",
        "genre": "Drama",
        "director": "Damien Power",
        "poster": "https://image.tmdb.org/t/p/w500/qYjdnXgfLUGnaHQ7geRlfCmwEZV.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Walker",
        "year": "2022",
        "description": "A dark and disturbing story about a family of sex workers…",
        "genre": "Drama",
        "director": "Joel Lamangan",
        "poster": "https://image.tmdb.org/t/p/w500/28vS3iVZWQOoJvaTtOoyJIRO2ja.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Spread",
        "year": "2012",
        "description": "A sexually transmitted disease causes students to drop dead at an alarming rate on a Midwest campus. When Cameron discovers his girlfriend is the first victim, he becomes the first suspect.",
        "genre": "Mystery, Science Fiction, TV Movie, Thriller",
        "director": "Scott Beck",
        "poster": "https://image.tmdb.org/t/p/w500/aJA8PA7SMUF96EMgQK9fcrvRTtM.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Hotel",
        "year": "2001",
        "description": "A sex worker, a hired killer, and a movie crew cross paths in a Venice hotel where human meat is on the menu.",
        "genre": "Comedy",
        "director": "Mike Figgis",
        "poster": "https://image.tmdb.org/t/p/w500/D6ExKDN7RvMQHuVIP18woG70ZN.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Sorceress",
        "year": "1995",
        "description": "Two friends, who both work for the same high-priced, high-powered law firm, are both married to modern day witches. Erica, the wife of Larry, believes that he is being led astray by Carol, an old flame, who also works for the same law firm. Erica decides to act and one night after a torrid sex session Larry drifts off to sleep and begins to dream. Soon the dream turns into a nightmare of sex, violence, murder and death involving himself, his friends and colleagues from the law firm which appears to be frighteningly realistic...",
        "genre": "Fantasy, Horror, Thriller",
        "director": "Jim Wynorski",
        "poster": "https://image.tmdb.org/t/p/w500/4yTPpffXf0WA33rgweZ1Y7PUe0L.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Forbidden Secrets",
        "year": "2006",
        "description": "Debbie and Mitch try to get over each other by seeing how many people they can have sex with. In this sexual competition, there are no losers.",
        "genre": "Drama, Romance",
        "director": "David Levy",
        "poster": "https://image.tmdb.org/t/p/w500/uWvMIGynbaVXJERidRdlDNdqqyS.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Drive Angry",
        "year": "2011",
        "description": "Milton is a hardened felon who has broken out of Hell, intent on finding the vicious cult who brutally murdered his daughter and kidnapped her baby. He joins forces with a sexy, tough-as-nails waitress, who's also seeking redemption of her own. Caught in a deadly race against time, Milton has three days to avoid capture, avenge his daughter's death, and save her baby before she's mercilessly sacrificed by the cult.",
        "genre": "Fantasy, Thriller, Action, Crime",
        "director": "Patrick Lussier",
        "poster": "https://image.tmdb.org/t/p/w500/nx2pChi41Xv4dsXsfSG3gnKcWaY.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Sisid Marino",
        "year": "2024",
        "description": "A married couple falls into depression after the death of their child. They turn to sex as a coping mechanism, but poverty takes its toll on them.",
        "genre": "Drama",
        "director": "Joel Lamangan",
        "poster": "https://image.tmdb.org/t/p/w500/1hHCveRsNE1DsBroSjTgyDo81Co.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Deadly Crush",
        "year": "2018",
        "description": "When a painter rents a secluded cabin to jump start her creativity, she has sex with a ghost and finds herself part of his plan to bring itself back to life.",
        "genre": "Horror, Thriller",
        "director": "Dakota Aesquivel",
        "poster": "https://image.tmdb.org/t/p/w500/k0R9rLOCyvgilmBnchwAR1eYCOv.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Here, Freaks!",
        "year": "1981",
        "description": "Three short stories about sex and sexual perversion.",
        "genre": "Horror, Comedy",
        "director": "David Cardoso",
        "poster": "https://image.tmdb.org/t/p/w500/3K53gGGrZjQxkA9rXOkx5tpaalD.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "The Trio",
        "year": "1998",
        "description": "Zobel and Karl are a long time gay couple who live together in a trailer home with Lizzie, Zobel's spunky daughter from a heterosexual misadventure. Together these three form a team of thieves who eke out an existence as pickpockets. After a botched job, Karl becomes unable to work, forcing Zobel and Lizzie to seek out a new partner. Lizzie recruits Rudolf, the boyishly charming town misfit. Reluctantly, Zobel allows Rudolf to join them but warns him to never break the golden rule: \"No exchanging of bodily fluids within the team.\" This dictum becomes increasingly difficult to live by as Lizzie's cravings and Zobel's own passions toward Rudolf intensify. Eventually, the golden rule is broken by Lizzie...and then again by Zobel (unbeknownst to Lizzie, of course). An intricate love triangle soon develops amongst the three that is shaped by deception, desire, and betrayal.",
        "genre": "Comedy, Crime, Romance",
        "director": "Hermine Huntgeburth",
        "poster": "https://image.tmdb.org/t/p/w500/9GjzLzJXUnk2OSYYGD5MVxaTmx.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "BearCity",
        "year": "2010",
        "description": "Set in New York's gay \"bear\" scene and taking a cue from the popular HBO franchise \"Sex and the City,\" BearCity follows a tight-knit pack of friends experiencing comical mishaps, emotionally sweet yet lusty romantic encounters and a cast of colorful, diverse characters as they gear up for a big party weekend",
        "genre": "Comedy, Romance",
        "director": "Douglas Langway",
        "poster": "https://image.tmdb.org/t/p/w500/tfYnt1caU4YhpHMyMvdxq6xW4jw.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Female Ninjas Magic Chronicles 5: Secret Story of Jiraiya",
        "year": "1995",
        "description": "This time the girls are the bad guys. Which means they will be a lot nude and action in this series and they have to fight a superhero called Jirasyso.",
        "genre": "Action, Comedy, Fantasy",
        "director": "Masaru Tsushima",
        "poster": "https://image.tmdb.org/t/p/w500/xtrBJV3BLCujq4IMJYvUJsJVeNh.jpg",
        "category": "movies",
        "reason": "Keyword: nude"
    },
    {
        "title": "Dirty World",
        "year": "1978",
        "description": "Senator Alberici tries to approach the secretariat of his party with a campaign against immorality. In reality the politician is a pervert with homosexual tendencies that he expresses with men and women.",
        "genre": "Drama",
        "director": "Sergio Bergonzelli",
        "poster": "https://image.tmdb.org/t/p/w500/5it9BFjnzTDfGoyosH6zVBOio5B.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Sexual Limits",
        "year": "2007",
        "description": "Dan forgets her girlfriend Catalina's birthday and goes to work. Their friends- a couple Miguel and Sahara and Rose come and they tell various sex stories. and when Dan comes he is put into a test about their sexual limits.",
        "genre": "Drama",
        "director": "Victor Dubanai",
        "poster": "https://image.tmdb.org/t/p/w500/stdKuEkJ6WEPhDRQi4RJrpy6JsO.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "L’orgia",
        "year": "1978",
        "description": "A group of boys and girls are locked up a weekend in a friends house in which they do a party that little to little is converted in an orgy. But not everything is sex, there are also cinematographic digressions, chocolate and churros, and good humor.",
        "genre": "Comedy",
        "director": "Francesc Bellmunt",
        "poster": "https://image.tmdb.org/t/p/w500/gdsH3ioXgA7vW9mQqtWu0t0AuVj.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Spenser: Ceremony",
        "year": "1993",
        "description": "Spenser is hired to locate April Kyle, the missing daughter of Harry Kyle, millionaire and candidate for Governor. With the assistance of Hawk, Spenser travels from Boston's \"Combat Zone\" to Providence and the heart of child pornography in search of one seemingly unimportant runaway whom nobody wants found.",
        "genre": "TV Movie, Drama, Crime",
        "director": "Paul Lynch",
        "poster": "https://image.tmdb.org/t/p/w500/qEMZM1A5IeUTR20fJWJWEiKrXJX.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Dragnet",
        "year": "1987",
        "description": "LAPD Sgt. Joe Friday -- the equally straight-laced nephew of the famous police sergeant of the same name -- is paired up with a young, freewheeling detective named Pep Streebeck. After investigating some strange robberies at the local zoo and the theft of a stockpile of pornographic magazines, they uncover cult activity in the heart of the city and are hot on the case to figure out who's behind it all.",
        "genre": "Action, Comedy, Crime",
        "director": "Tom Mankiewicz",
        "poster": "https://image.tmdb.org/t/p/w500/77H17YDeHoJCHebpfGF1rY3Dfof.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "The Heirs",
        "year": "2015",
        "description": "Teenagers’ leisure at full swing: a group of friends spend their holidays at parties, having sex, boozing, and partaking in any adventure that brings them a boost of adrenaline. As they use violence for entertainment and to fulfill their authoritarian fantasies, their adventures will show the cracks and the collapse of the perfect world they live in.",
        "genre": "Drama",
        "director": "Jorge Hernández Aldana",
        "poster": "https://image.tmdb.org/t/p/w500/a9ra2oRy3UP1Cm3xeUCkWcflWKu.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Porn in the Hood",
        "year": "2012",
        "description": "3 childhood friends who have never left their hometown in the suburb try to get into porn as a way of earning easy money.",
        "genre": "Comedy",
        "director": "Franck Gastambide",
        "poster": "https://image.tmdb.org/t/p/w500/cUW7NUzXJbvsZyM0LAAo5ftgov6.jpg",
        "category": "movies",
        "reason": "Keyword: porn"
    },
    {
        "title": "Straight-Jacket",
        "year": "2004",
        "description": "In 1950's Hollywood, movie star Guy Stone must marry a studio secretary in order to conceal his homosexuality. Sally has no idea her marriage is a sham, though, and turns Guy's life upside-down. However, soon after the wedding, Guy develops feelings for a writer named Rick.",
        "genre": "Comedy, Romance",
        "director": "Richard Day",
        "poster": "https://image.tmdb.org/t/p/w500/pzsviJHkJ3menowGvcZUNIbPWOZ.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Dilig",
        "year": "2024",
        "description": "About to get married to an old, wealthy businessman, Resa enlists the help of gardener Otso to seduce her fiancé’s daughter, Katelyn, and record his sexploits with her in order to get her disowned.",
        "genre": "Drama",
        "director": "Christian Paolo Lat",
        "poster": "https://image.tmdb.org/t/p/w500/lDn02aAZFUb7JpM7l7iuHdbWEHH.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Bound",
        "year": "2015",
        "description": "The daughter of a wealthy real estate mogul falls in love with a younger man, and she is introduced to the world of BDSM. With her newly awakened sexual prowess, she is finally able to take control of her life.",
        "genre": "Thriller, Drama",
        "director": "Jared Cohn",
        "poster": "https://image.tmdb.org/t/p/w500/3qxA0avnx9CEgrUdDStT4CZmgqE.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Secrets of Palace coup d'etat. Russia, 18th century. Film №1. Testament Emperor",
        "year": "2000",
        "description": "Russia, January 25, 1725. \"Give it all...\". The emperor's weakening hand was able to write in his will only these two short incomprehensible words that kept Russia in a bloody struggle for the crown for a century.",
        "genre": "History, Drama",
        "director": "Svetlana Druzhinina",
        "poster": "https://image.tmdb.org/t/p/w500/qQ6PkvdJs38aRP86YaNxN72FDqR.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "From Straight A's to XXX",
        "year": "2017",
        "description": "When a change of circumstances leaves Miriam unable to pay her college tuition, she makes a surprising decision: to start performing in adult films, using the pseudonym Belle Knox. Miriam lies to her family and her friends at school, keeping her double life a secret. But soon rumours spread and Miriam becomes the subject of vicious online attacks and unwanted attention. Miriam fights back: she talks to the media, saying her new line of work empowers her as a feminist. But her confident stand has unintended consequences. Miriam is shunned by her conservative family and her colleagues in the adult film world. One impulsive decision has quickly spiralled out of control - and Miriam's problems are just beginning.",
        "genre": "Drama, TV Movie",
        "director": "Vanessa Parise",
        "poster": "https://image.tmdb.org/t/p/w500/kvcdaGcres9pGDwZfPN9jOKfZh.jpg",
        "category": "movies",
        "reason": "Keyword: xxx"
    },
    {
        "title": "Muži nestárnou",
        "year": "1942",
        "description": "In 1911, Stáňa Járský was giving music lessons to little Jiřina Horníková and fell passionately in love with his pupil's mother. The evening before he left for his studies, Mrs. Helena succumbed to him. Nine years later, engineer Járský met the grown-up Jiřina in Prague - and love met him again. However, this time he was not lucky either, the girl had to save the family factory with a marriage of convenience. After another nineteen years, CEO Járský returns home after a long stay abroad. His hair is graying, but he is still charming and elegant. How will his meeting with young Helenka, the granddaughter and daughter of his former loves, turn out?",
        "genre": "Romance, Comedy",
        "director": "Vladimír Slavínský",
        "poster": "https://image.tmdb.org/t/p/w500/bF9mZbTUkiUZveDVUfuAFRZaVvZ.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Demi-sœurs",
        "year": "2018",
        "description": "Lauren, a lovely 29-year-old it-girl, tries to break into the world of fashion by skimming Parisian parties. Olivia, a 28-year-old psychologist, has two obsessions: to save the confectionery of her parents, and to find her ideal husband. At the age of 26, Salma, a fiery young history teacher, still lives with her mother in the suburbs. Their roads have no reason to cross - until the day when, on the death of their biological father that they never knew, they inherit together a splendid Parisian apartment. For these three sisters who have nothing in common, cohabitation will prove to be explosive, to say the least.",
        "genre": "Comedy",
        "director": "Saphia Azzedine",
        "poster": "https://image.tmdb.org/t/p/w500/iQwBOtpMu2wDqT0PdGi3dv5M56j.jpg",
        "category": "movies",
        "reason": "Foreign Characters"
    },
    {
        "title": "Jakarta Deep Down",
        "year": "2012",
        "description": "An omnibus of 10 stories, 10 romances that portrays lesbian, gay, bisexual and transgender relationships throughout Jakarta.",
        "genre": "Drama",
        "director": "Tika Pramesti",
        "poster": "https://image.tmdb.org/t/p/w500/eGE62ab0DPCVtudvQQ9cQzoKNSD.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    },
    {
        "title": "Dog Lay Afternoon",
        "year": "1976",
        "description": "A young girl witnesses her mother having sex with the family dog. When her father finds out, he burns the dog alive. She is so traumatized by these incidents that she later turns into a nymphomaniac. She moves to an island and lives there with her own dog, having sex with various guests who visit her.",
        "genre": "Drama, Horror, Thriller",
        "director": "Peter Skerl",
        "poster": "https://image.tmdb.org/t/p/w500/cOtgea9A4ivV9OzdXsjEwmxLljR.jpg",
        "category": "movies",
        "reason": "Keyword: sex"
    }
]